import 'package:flutter/material.dart';
import 'package:keralaulama/classes/class.dart';
import 'package:keralaulama/widgets/card_widget.dart';

class Mattushr extends StatefulWidget {
  const Mattushr({Key? key}) : super(key: key);

  @override
  _MattushrState createState() => _MattushrState();
}

class _MattushrState extends State<Mattushr> {
  late List<ItemClass> items;
  late List<ItemClass> filteredItems;
  bool isSearching = false;
  @override
  void initState() {
    super.initState();
    // Sample data
    items = [
               
ItemClass(title: 'മേനക്കോത്ത് മുസ്ലിയാർ', imagePath: 'images/ulam.jpg',name:'മേനക്കോത്ത് കുഞ്ഞഹമ്മദ് കുട്ടി മുസ്ലിയാർ' ,birth: 'ഹി 1233',place:'' ,teachers:'ശൈഖ് അലിയ്യുബ്നു അഹ്മദുൽ ഹമദാനി,വെളിയങ്കോട് ഉമർ ഖാളി, വലിയ ബാവ മുസ്‌ലിയാർ, സൈനുദ്ദീൻ മഖ്ദൂം അഖീർ' ,students: 'നുഞ്ഞേരി കുഞ്ഞഹമ്മദ് ശൈഖ്, ഫരീദ് മുസ്‌ലിയാർ, ശൈഖ് മുഹമ്മദുൽ ഹമദാനി',services:'' ,designation:'' ,writings: '',death: '1780 (ഹി 1290 റബീഉൽ അവ്വൽ 17)',tomb: 'നാദാപുരം പള്ളി',degree: ''),
ItemClass(title: 'അവുക്കോയ മുസ്ലിയാർ', imagePath: 'images/ulam.jpg',name:'അവുക്കോയ മുസ്ലിയാർ' ,birth: 'ഹി 1222',place:'പരപ്പനങ്ങാടി' ,teachers:'അല്ലാമാ അഹ്മദുൽ മഖ്ദൂം, അല്ലാമാ മുഹമ്മദുൽ ഹമദാനി, സയ്യിദ് ബലാഫതനി,വെളിയങ്കോട് ഉമർ ഖാളി' ,students: '',services:'താനൂർ വലിയ കുളങ്ങര, തിരൂരങ്ങാടി നടുവിലെ പള്ളി, പരപ്പനങ്ങാടി പനയത്തിൽ  ജുമുഅത് പള്ളി തുടങ്ങിയ സ്ഥലങ്ങളിൽ  മുദരിസ്' ,designation:'' ,writings: '',death: '1875 (ഹി 1292)',tomb: 'പരപ്പനങ്ങാടി പള്ളി',degree: ''),
ItemClass(title: 'പാടൂര്‍ കോയക്കുട്ടി', imagePath: 'images/ulam.jpg',name:'സയ്യിദ് ഫഖ്റുദ്ദീന്‍ അല്‍ ബുഖാരി എന്ന പാടൂര്‍ കോയക്കുട്ടി' ,birth: '',place:'വെട്ടത്ത് പുതിയങ്ങാടി കോട്ടത്തറ' ,teachers:'' ,students: '',services:'' ,designation:'' ,writings: 'മനാസികുല്‍ മലൈബാരി ഫീ ഹജ്ജി ബൈത്തില്ലാഹില്‍ ബാരി,രിസാലത്തുല്‍ ഉല്‍വ്വിയ്യ,  റദ്ദുല്‍ മതീന്‍ ഫീ ഫത്മി മത്‌നി ബദ്‌രില്‍ മുബീന്‍, തിര്‍യാഖുശ്ശിഫാ, ഫവാഇദുല്‍ ഉനാസ്, സൈഫുല്‍ മുളീഅ്',death: '1881 (ഹി 1298 റബീഉല്‍ ആഖിര്‍ 3)',tomb: ' മസ്ജിദുല്‍ വുസ്താ പാടൂര്‍',degree: ''),
ItemClass(title: 'സൈനുദ്ദീന്‍ റംലി', imagePath: 'images/ulam.jpg',name:'സൈനുദ്ദീന്‍ റംലി എന്ന മണലില്‍ സൈനുദ്ദീന്‍ മുസ്ലിയാർ' ,birth: 'ഹിജ്‌റ 1249',place:'' ,teachers:'പരപ്പനങ്ങാടി ഔക്കോയ മുസ്‌ലിയാര്‍, വെളിയങ്കോട് ഉമര്‍ ഖാദി, അല്ലാമാ അബ്ദുല്‍ ഹമീദ് ശര്‍വാനി മക്കി, ശൈഖ് അഹമ്മദ് സൈനി ദഹ്ലാന്‍, മുഹമ്മദ് ഹിസ്ബുല്ലാഹില്‍ മക്കി' ,students: 'പുത്തന്‍പള്ളി കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, എരമംഗലം ഹിശാം മുസ്‌ലിയാര്‍, തട്ടാങ്ങര കുട്ട്യാമു മുസ്‌ലിയാര്‍,  കുഞ്ഞന്‍ ബാവ മുസ്‌ലിയാര്‍, ശൈഖ് സിറാജുദ്ദീന്‍ ഖാദിരി, അഹമ്മദ് ബാവ മുസ്‌ലിയാര്‍, ശൈഖ് അലി ഹസന്‍  എന്ന കോയക്കുട്ടി മുസ്‌ലിയാര്‍, ചുളളിയില്‍ അബൂബക്കര്‍ മുസ്‌ലിയാര്‍, കോടഞ്ചേരി അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, വളപ്പില്‍ അബ്ദുല്‍ അസീസ് മുസ്‌ലിയാര്‍, കുറ്റൂര്‍ കമ്മുണ്ണി മുസ്‌ലിയാര്‍, പുന്നയൂര്‍കുളം അഹമ്മദ് മുസ്‌ലിയാര്‍, കോക്കൂര്‍ കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, ഖാദി അബ്ദുള്ള മുസ്‌ലിയാര്‍ കാസര്‍ഗോഡ്, ശുജാഇ മൊയ്തു മുസ്‌ലിയാര്‍, അണ്ടത്തോട് അമ്മു മുസ്‌ലിയാര്‍, ഞമനേക്കാട് ഏനി കുട്ടി മുസ്‌ലിയാര്',services:'തിരൂരങ്ങാടി നടുവിലെ പള്ളി, പൊന്നാനി മഖ്ദൂം പള്ളി എന്നിവിടങ്ങളിൽ ദർസ് നടത്തി' ,designation:'' ,writings: '',death: '1891 (ഹിജ്‌റ 1309 ജമാദുല്‍ ആഖിര്‍)',tomb: 'നൂനക്കടവ് ജുമാമസ്ജിദ്',degree: ''),
ItemClass(title: 'താനൂർ അബ്ദുറഹ്മാൻ ശൈഖ്', imagePath: 'images/ulam.jpg',name:'താനൂർ അബ്ദുറഹ്മാൻ മുസ്ലിയാർ' ,birth: 'ഹി 1257',place:'' ,teachers:'സൈനുദ്ദീൻ മുസ്‌ലിയാർ, വലിയ അഹ്മദ് എന്ന ബാവ മുസ്‌ലിയാർ,  പരപ്പനങ്ങാടി ഔക്കോയ മുസ്ലിയാർ' ,students: 'യുസുഫ് മുസ്‌ലിയാർ,വാളക്കുളം നരിമടക്കൽ അഹ്മദ് കുട്ടി ഹാജി, മുഹമ്മദ് മുസ്ലിയാർ',services:'വലിയകുളങ്ങര പള്ളിയിൽ മുദരിസ്' ,designation:'' ,writings: 'അവാരിഫുല്‍ മആരിഫ്, ഇഫാദത്തുല്‍ ഖുദുസിയ്യ ഫീ ഇഖ്തിലാഫി ത്വറഫി സ്സൂഫിയ്യ, അസ്‌റാറുല്‍ മുഹഖിഖീന്‍ ഫീ മഅ്‌രിഫത്തി റബ്ബില്‍ ആലമീന്‍',death: 'ഹി: 1322 ശവ്വാല്‍ 22',tomb: '',degree: ''),
ItemClass(title: 'ശൈഖ് അലിയ്യുത്തൂരി', imagePath: 'images/ulam.jpg',name:'ശൈഖ് അലിയ്യുത്തൂരി എന്ന അലി മുസ്ലിയാര്‍ കട്ടിലശ്ശേരി' ,birth: '1850(ഹി1266)',place:'മലപ്പുറം,കൊളത്തൂര്' ,teachers:'മഖ്ദൂം അഖീര്‍, പൊന്നാനി വലിയ ബാവ മുസ്‌ലിയാര്‍, ചെറിയ ബാവ മുസ്ലിയാര്‍,അഹ്മദ് സൈനീ ദഹ്ലാന്‍, മുഹമ്മദ് ഹസ്ബുല്ലാഹില്‍ മക്കി' ,students: 'യൂസുഫുല്‍ ഫള്ഫരി, ചെറുശ്ശേരി അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, അരിപ്ര മൊയ്തീന്‍ ഹാജി, പാങ്ങില്‍ അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, വെള്ളേങ്ങര മുഹമ്മദ് മുസ്ലിയാര്‍, പാതിരമണ്ണ കുഞ്ഞീദു മുസ്ലിയാർ',services:'പെന്നാനി,പുളിക്കല്‍, വറ്റലൂര്‍, കരിഞ്ചാപ്പാടി എന്നിവിടങ്ങളിൽ ദർസ് നടത്തി' ,designation:'' ,writings: '',death: '1916 (ഹി 1334 റജബ് 26 )',tomb: 'കരിഞ്ചാപ്പാടി ജുമുഅത്ത് പള്ളി',degree: ''),
ItemClass(title: 'ഖാദർ ഫള്ഫരി', imagePath: 'images/ulam.jpg',name:'ഖാദർ ഫള്ഫരി' ,birth: 'അബ്ദുൽ ഖാദർ ഫള്ഫരി',place:'1895 (ഹി.1313 റജബ് 6)' ,teachers:'' ,students: 'മുഹമ്മദ് ഫള്ഫരി, പാങ്ങിൽ അഹമ്മദ് കുട്ടി മുസ്ലിയാർ, ശൈഖ് അബ്ദുൽ ജബ്ബാർ ഹസ്റത്ത് , അബ്ദുറഹീം ആതൂരി , അബ്ദുൽ അസീസ് വെല്ലുരി',services:'' ,designation:'ഖാസിമിയ്യ, പള്ളിപ്പുറം, മണ്ണാർക്കാട് മഅ്ദിനുൽ ഉലൂം, വാഴക്കാട് ദാറുൽ ഉലൂം എന്നിവിടങ്ങളില്‍ ദര്‍സ് നടത്തി' ,writings: 'ജവാഹിദുൽ അശ്അരി വഗറാഇബുൽ ഹികായാതി വൽ അഖ്ബാർ , തുഹ്ഫതു സ്വിബിയാൻ ഫീ ബയാനിൽ ഈമാനി വൽ ഇസ്ലാം',death: '1944 ( 1363 റജബ് 17 )',tomb: 'പെരിമ്പലം ജുമാ മസ്ജിദ്',degree: 'ബാഖവി'),
ItemClass(title: ' ആലി മുസ്ലിയാർ', imagePath: 'images/nellikkutth ali jusliyar.jpg',name:'നെല്ലിക്കുത്ത് ആലി മുസ്ലിയാർ' ,birth: '1864 (ഹി 1270)',place:'മഞ്ചേരി, നെല്ലിക്കുത്ത്' ,teachers:'സൈനുദ്ദീന്‍ മഖ്ദൂം അഖീര്‍, ചെറിയ ബാവ മുസ്‌ലിയാര്‍, കൊങ്ങണംവീട്ടില്‍ ഇബ്‌റാഹീം മുസ്‌ലിയാര്‍ ,സയ്യിദ് അഹ്മദ് സൈനീ ദഹ്‌ലാന്‍, മുഹമ്മദ് ഹിസ്ബുല്ലാഹില്‍ മക്കി, സയ്യിദ് ഹുസൈന്‍ അല്‍ഹബ്ശി' ,students: 'അഹ്മദ് കോയ ശാലിയാത്തി, കൊല്ലോളി അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, കോടഞ്ചേരി കുഞ്ഞിമുഹമ്മദ് മുസ്‌ലിയാര്‍, ബൈത്താന്‍ കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, കാടേരി ഹസന്‍ മുസ്‌ലിയാര്‍, ഇബ്രാഹീം മുസ്‌ലിയാര്‍ പട്ടിക്കാട്, പാണ്ടിക്കാട് ആലി മുസ്‌ലിയാര്‍, മാടമ്പി അലവി മുസ്‌ലിയാര്‍',services:'ലക്ഷദ്വീപിലെ കവരത്തി ,വണ്ടൂരിനടുത്ത തൊടുകപ്പുലം, പൊടിയാട്ട് പാറമ്മല്‍, മേല്‍മുറി, നെല്ലിക്കുത്ത്,തിരൂരങ്ങാടി കിഴക്കേപള്ളി എന്നിവിടങ്ങളിൽ ദർസ് നടത്തി' ,designation:'' ,writings: 'ഹാശിയത്തു അല്ലഫല്‍ അലിഫ്, ഹാശിയത്തു തുഹ്ഫത്തില്‍ ഇഖ്‌വാന്‍, ശറഹു തുഹ്ഫതിൽ വർദിയ്യ',death: '1922 ഫെബ്രുവരി 17 (ഹി 1340 ജുമാദല്‍ ആഖര്‍ 20)',tomb: 'കോയമ്പത്തൂര്‍ മേട്ടുപാളയം',degree: ''),
ItemClass(title: 'ശൈഖ് അഹ്മദ് സ്വഗീര്‍', imagePath: 'images/ulam.jpg',name:'ശൈഖ് അഹ്മദ് സ്വഗീര്‍ എന്നതട്ടാങ്ങര കുട്ടിയമ്മു മുസ്ലിയാർ' ,birth: '1273 ദുല്‍ഹിജ്ജ 23',place:'' ,teachers:'സൈനുദ്ദീന്‍ മഖ്ദൂം അഖീർ ,പെരുമ്പടപ്പ് സൈനുദ്ദീന്‍ റംലി' ,students: 'കരിമ്പന അഹ്മദ് മുസ്‌ലിയാര്‍, പാനായിക്കുളം പുതിയാപ്പള അബ്ദുറഹ്മാന്‍ മുസ്‌ലിയാര്‍, തറക്കണ്ടി അബ്ദുറഹ്മാന്‍ മുസ്‌ലിയാര്‍, ചാലിലകത്ത് കുഞ്ഞഹമ്മദ് ഹാജി, ഉപ്പുങ്ങല്‍ ബാപ്പുട്ടി മുസ്‌ലിയാര്‍, അബ്ദുല്‍ഖാദര്‍ മുസ്‌ലിയാര്‍ ബ്ലാങ്ങാട്, താണാപാടം മുഹമ്മദ് മുസ്‌ലിയാര്‍, ചെമ്പ്ര പോക്കര്‍ മുസ്‌ലിയാര്‍, കോക്കൂര്‍ അബ്ദുല്ല മുസ്‌ലിയാര്‍, പരൂര്‍ കുഞ്ഞിഅഹ്മദ് മുസ്‌ലിയാര്‍, വളവന്നൂര്‍ പരീക്കുട്ടി മുസ്‌ലിയാര്',services:'' ,designation:'' ,writings: '',death: '1922 (ഹിജ്‌റ 1341 റജബ് 10)',tomb: 'തട്ടാങ്ങര പള്ളി',degree: ''),
ItemClass(title: 'കോക്കൂര്‍ മുസ്‌ലിയാർ', imagePath: 'images/ulam.jpg',name:'കോക്കൂര്‍അബ്ദുല്ലക്കുട്ടി  മുസ്‌ലിയാർ' ,birth: 'ഹിജ്‌റ 1290',place:'കോടഞ്ചേരി' ,teachers:'കുഞ്ഞന്‍ബാവ മുസ്‌ലിയാര്‍, കൊങ്ങണംവീട്ടില്‍ ഇബ്‌റാഹീം മുസ്‌ലിയാര്‍, തട്ടാങ്ങര കുട്ടിയമ്മു മുസ്‌ലിയാര്‍ ,അബ്ദുല്‍ വഹാബ് ഹസ്‌റത്ത്, അബ്ദുറഹീം ഹസ്‌റത്ത്, അബ്ദുല്‍ അസീസ് ഹസ്‌റത്ത്' ,students: '',services:'തൃക്കുന്നപ്പുഴ, കോക്കൂര്‍ ജുമുഅത്ത് പള്ളി എന്നിവിടങ്ങളില്‍ ദര്‍സ് നടത്തി' ,designation:'' ,writings: '',death: '1927 (ഹിജ്‌റ 13460)',tomb: 'കോക്കൂര്‍ ജുമുഅത്ത് പള്ളി',degree: ''),
ItemClass(title: 'വലിയാക്കത്തൊടി അഹ്മദ് മുസ്‌ലിയാർ', imagePath: 'images/ulam.jpg',name:'വലിയാക്കത്തൊടി അഹ്മദ് മുസ്‌ലിയാർ' ,birth: 'വലിയാക്കത്തൊടി അഹ്മദ് മുസ്‌ലിയാർ',place:'1871 (ഹി1288)' ,teachers:'' ,students: 'കുറ്റൂര്‍ കമ്മുണ്ണി മുസ്‌ലിയാർ, കുഞ്ഞന്‍ബാവ മുസ്‌ലിയാര്‍, ചെറിയ മമ്മിക്കുട്ടി മുസ്ലിയാർ',services:'' ,designation:'പൂഴിക്കുത്ത് ജുമുഅത്ത് പള്ളി , അച്ചിപ്ര, ചെലൂര്‍ എന്നിവിടങ്ങളില്‍ ദര്‍സ് നടത്തി' ,writings: '',death: '1932 (ഹി 1351)',tomb: 'ഇരുകുളം ജുമുഅത്ത് പള്ളി',degree: ''),
ItemClass(title: 'ഖാദർ ഫള്ഫരി', imagePath: 'images/ulam.jpg',name:'ഖാദർ ഫള്ഫരി' ,birth: 'അബ്ദുൽ ഖാദർ ഫള്ഫരി',place:'1895 (ഹി.1313 റജബ് 6)' ,teachers:'' ,students: 'മുഹമ്മദ് ഫള്ഫരി, പാങ്ങിൽ അഹമ്മദ് കുട്ടി മുസ്ലിയാർ, ശൈഖ് അബ്ദുൽ ജബ്ബാർ ഹസ്റത്ത് , അബ്ദുറഹീം ആതൂരി , അബ്ദുൽ അസീസ് വെല്ലുരി',services:'' ,designation:'ഖാസിമിയ്യ, പള്ളിപ്പുറം, മണ്ണാർക്കാട് മഅ്ദിനുൽ ഉലൂം, വാഴക്കാട് ദാറുൽ ഉലൂം എന്നിവിടങ്ങളില്‍ ദര്‍സ് നടത്തി' ,writings: 'ജവാഹിദുൽ അശ്അരി വഗറാഇബുൽ ഹികായാതി വൽ അഖ്ബാർ , തുഹ്ഫതു സ്വിബിയാൻ ഫീ ബയാനിൽ ഈമാനി വൽ ഇസ്ലാം',death: '1944 ( 1363 റജബ് 17 )',tomb: 'പെരിമ്പലം ജുമാ മസ്ജിദ്',degree: 'ബാഖവി'),
ItemClass(title: 'കോയക്കുട്ടി തങ്ങൾ', imagePath: 'images/ulam.jpg',name:'സയ്യിദ് മുഹമ്മദുല്‍ ബുസ്താനി കോയക്കുട്ടി തങ്ങൾ' ,birth: 'ഹിജ്‌റ 1300',place:'ചാവക്കാട് കടപ്പുറം' ,teachers:'' ,students: '',services:'' ,designation:'മൂവ്വാറ്റുപുഴ, കോതമംഗലം ഉള്‍പ്പെടെയുള്ള നാല്‍പ്പതോളം മഹല്ലുകളുടെ ഖാളി' ,writings: 'മിന്‍ഹത്തുല്‍ ഖുദ്ദൂസിയ്യ ഫീ മആസിരി ദസൂഖിയ്യ, അന്‍വാറുറബ്ബാനിയ്യ വല്‍ അസ്‌റാറുല്‍ ബുസ്താനിയ്യ, അശ്ശഖാശിഖുല്‍ ബുസ്താനിയ്യ ഫീ മദാഇഹി ഖൈരില്‍ ബരിയ്യ, റൗളത്തുന്നദിയ്യ ഫീ മദാഇഹില്‍ ഗൗസിയ്യ',death: '1959 ( ഹി 1380 ജമാദുല്‍ ആഖിര്‍ 11 )',tomb: 'ചാവക്കാട് ബുഖാറ',degree: ''),
ItemClass(title: 'കടവനാട് ഉസ്താദ്', imagePath: 'images/ulam.jpg',name:'കടവനാട് അബൂബക്കര്‍ മുസ്‌ലിയാര്' ,birth: '1887 (ഹി 1305)',place:'പൊന്നാനി' ,teachers:'പൊന്നാനി തുന്നംവീട്ടില്‍ മുഹമ്മദ് മുസ്‌ലിയാർ,വെളിയങ്കോട് തട്ടാങ്ങര കുട്ടിയമ്മു മുസ്‌ലിയാര്‍, ചാലിലകത്ത് കുഞ്ഞഹമ്മദ് ഹാജി' ,students: '',services:'മണ്ണാര്‍ക്കാട് മഅ്ദനുല്‍ ഉലൂം, ചെമ്മണ്ണൂര്‍, അഴിയൂര്‍, പരപ്പനങ്ങാടി ഒട്ടുമ്മല്‍, പരപ്പനങ്ങാടി കടപ്പുറം പള്ളി എന്നിവിടങ്ങളില്‍ ദര്‍സ് നടത്തി' ,designation:'' ,writings: '',death: '1961 ( ഹി 1381 ശവ്വാല്‍ 28 )',tomb: 'കോടഞ്ചേരി ജുമുഅത്ത് പള്ളി',degree: ''),
ItemClass(title: 'ഹാഫിള് അബൂബക്കര്‍  മുസ്‌ലിയാർ', imagePath: 'images/ulam.jpg',name:'ഹാഫിള് അബൂബക്കര്‍ കുട്ടി മുസ്‌ലിയാർ' ,birth: 'ഹിജ്റ 1313',place:'മലപ്പുറം,  ഓമച്ചപ്പുഴ' ,teachers:'പാങ്ങില്‍ അഹ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, ഇരുമ്പാലശ്ശേരി വലിയ കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍,  കക്കാട് മരക്കാര്‍ മുസ്‌ലിയാര്‍, കിടങ്ങയം ഇബ്രാഹീം മുസ്‌ലിയാർ,ചെമ്പ്ര പോക്കർ മുസ്ലിയാർ - കുറ്റൂർ കമ്മുണ്ണി മുസ്ലിയാർ ,യാഫിഈ സൈതാലി മുസ്ലിയാർ,  സ്വദഖത്തുള്ള മുസ്ലിയാർ,നിറമര' ,students: '',services:'' ,designation:'' ,writings: '',death: '1382 മുഹറം 6-ന് (1962 ജൂണ്‍ 9)',tomb: 'ഓമച്ചപ്പുഴ പുതിയ പള്ളി',degree: ''),
ItemClass(title: 'ആലുവ അബൂബക്കർ മുസ്ലിയാർ', imagePath: 'images/aluva aboobakker musliyar.jpg',name:'ആലുവ അബൂബക്കർ മുസ്ലിയാർ' ,birth: '1884',place:'ആലുവാക്കടുത്ത് മുടിക്കൽ' ,teachers:'പുളികൽ ഫരീദ് മൗല,പെരുപുള്ളി അവർ മുസ്‌ലിയാർ,വെളിയങ്കോട് കോയ ഹസ്സൻ മുസ്ലിയാർ,കമുട്ടി മുസ്‌ലിയാർ' ,students: '',services:'' ,designation:'' ,writings: '',death: 'ഹി 1393 ദുൽ ഹിജ്ജ 12 (1974 ജനുവരി 6)',tomb: 'മുടിക്കൽ വീടിനടുത്ത്',degree: ''),
ItemClass(title: 'സി.എച്ച്. മുഹമ്മദ് കോയ', imagePath: 'images/ch muhammed koya.jpg',name:'ചെറിയൻകണ്ടി മുഹമ്മദ് കോയ എന്ന സി.എച്ച്. മുഹമ്മദ് കോയ' ,birth: '1927 ജൂലൈ 15',place:'അത്തോളി' ,teachers:'' ,students: '',services:'' ,designation:'ചന്ദ്രിക പത്രാധിപ സമിതി  അംഗം , കേരള നിയമസഭാ സ്പീക്കർ ,ചന്ദ്രികയുടെ ചീഫ് എഡിറ്റര്‍,മലബാര്‍ ജേര്‍ണലിസ്റ്റ് അസോസിയേഷന്‍ പ്രസിഡന്റ,വിദ്യാഭ്യാസമന്ത്രി,ആഭ്യന്തര വകുപ്പ് മന്ത്രി' ,writings: 'ലിയാഖത്ത് അലീഖാന്‍, എന്റെ ഹജ്ജ് യാത്ര ,നിയമസഭാ ചട്ടങ്ങള്‍ ,ഞാന്‍ കണ്ട മലേഷ്യ ,സൊവ്യറ്റ് യൂണ്യനില്‍,ഗള്‍ഫ് രാജ്യങ്ങളില്‍,ഇന്ത്യയിലെ മുസ്ലീം ഭരണകാലം കഥകളിലൂടെ',death: '1983 സെപ്റ്റംബർ 28',tomb: 'വെസ്റ്റ് നടക്കാവ് ജുമാ മസ്ജിദ്',degree: ''),
ItemClass(title: 'ഉമര്‍ അല്‍ഖാദിരി', imagePath: 'images/umer qadiry (3).jpg',name:'ശൈഖ് കമാലുദ്ദീന്‍ ഉമര്‍ അല്‍ഖാദിരി' ,birth: 'ഹിജ്റ 1335',place:'കോഴിക്കോട്  പറമ്പില്‍ ബസാർ' ,teachers:'കോടഞ്ചേരിയില്‍ ശൈഖ് അബൂബക്കര്‍ മുസ്ലിയാർ,അയിലക്കാട് ശൈഖ് സഈദ് സിറാജുദ്ദീന്‍ അല്‍ഖാദിരി' ,students: '',services:'' ,designation:'' ,writings: '',death: '1985 ആഗസ്റ്റ് 31 ( ഹി 1405 ദുല്‍ഹജ്ജ് 15)',tomb: 'കോഴിക്കോട്  പറമ്പില്‍ ബസാർ',degree: ''),
ItemClass(title: 'സയ്യിദ് ഇമ്പിച്ചിക്കോയ തങ്ങള്‍ബുഖാരി', imagePath: 'images/bukhari thanagal.jpg',name:'കടലുണ്ടി സയ്യിദ് അഹ്മദ് ഇമ്പിച്ചിക്കോയ തങ്ങള്‍ബുഖാരി' ,birth: '1931',place:'' ,teachers:' കൈപ്പറ്റ ബീരാന്‍കുട്ടി മുസ്‌ലിയാര്‍, കരുവന്‍തിരുത്തി ആലിക്കുട്ടി മുസ്‌ലിയാര്‍, വെളിമുക്ക് മുഹമ്മദലി മുസ്‌ലിയാര്‍, ഇപ്പാപ്പ മുസ്‌ലിയാര്‍, അബ്ദുല്‍ഖാദര്‍ ലബ്ബ' ,students: '',services:'' ,designation:'കടലുണ്ടി, കോടമ്പുഴ, കരുവന്‍തിരുത്തി എന്നിവിടങ്ങളില്‍ ഖാസി' ,writings: '',death: '1987 നവംബര്‍ 19 ( ഹി 1408 റബീഉല്‍ അവ്വല്‍ 27 )',tomb: 'കടലുണ്ടി ജുമാ മസ്ജിദ',degree: ''),
ItemClass(title: 'കക്കിടിപ്പുറം ശൈഖ്', imagePath: 'images/ulam.jpg',name:'കക്കിടിപ്പുറംഅബൂബക്കര്‍ മുസ്‌ലിയാര്' ,birth: '1902 ( ഹി 1369 )',place:'മലപ്പുറം   കക്കിടിപ്പുറം' ,teachers:'അയിലക്കാട് സിറാജുദ്ദീന്‍ സഈദ് മുസ്‌ലിയാർ,കുഞ്ഞിമല്‍ക്കാന്‍ മുസ്‌ലിയാർ,കുന്നപ്പള്ളി അബ്ദുറഹ്മാന്‍ കുട്ടി മുസ്‌ലിയാര്‍, തൃത്താല അബ്ദുറഹ്മാന്‍ മുസ്‌ലിയാര്‍, കെ.വി.എം പന്താവൂര്' ,students: '',services:'' ,designation:'' ,writings: 'രിസാലത്തു സഅതിറഹ്മ ഫീ ഇസാലത്തി തുഹ്മ അന്‍ മിഖീമില്‍ ജുമുഅ, ഹിദായത്തുല്‍ ഖൗം ഫീ ശറഹി രിസാലത്തി സൗം, അഖ്‌റബുത്വുറൂഖി ഇലല്‍ ഹഖ്, അസ്വലാത്തു അലാ അശ്‌റഫില്‍ ഖല്‍ഖ്, ശറഹുന്‍ അലാ ദലാഇലില്‍ ഖൈറാത്ത്',death: '1990 മെയ് 30 ( ഹി1410 ദുല്‍ഖഅ്ദ 6 )',tomb: 'കക്കിടിപ്പുറം',degree: ''),
ItemClass(title: 'സി.എം മടവൂർ', imagePath: 'images/ulam.jpg',name:'സി.എം  അബൂബക്കർ മുസ്‌ലിയാർ മടവൂർ' ,birth: '1929',place:'' ,teachers:'മോങ്ങം അവറാൻ കുട്ടി മുസ്‌ലിയാർ, മലയമ്മ നരകശ്ശേരി അബൂബക്കർ മുസ്‌ലിയാർ, ഇമ്പിച്ചാലി മുസ്‌ലിയാർ, ശംസുൽ ഉലമ, കുഞ്ഞി മുഹമ്മദ് മുസ്‌ലിയാർ, ശൈഖ് ആദം ഹസ്‌റത്ത്, ശെയ്ഖ് ഹസൻ ഹസ്‌റത്ത്' ,students: '',services:'മടവൂർ മുദരിസ്' ,designation:'' ,writings: '',death: '1991 ഏപ്രിൽ 1(ഹി 1141 ശവ്വാൽ 4)',tomb: 'മടവൂർ',degree: 'ബാഖവി'),
ItemClass(title: 'വടകര മുഹമ്മദാജി', imagePath: 'images/vadakara muhammed haji.jpg',name:'വടകര മുഹമ്മദാജി' ,birth: '1893',place:'കോഴിക്കോട്,ചെറുവണ്ണൂർ' ,teachers:'കുറ്റൂർ കമ്മുണ്ണി മുസ്ലിയാർ , വടകര അബൂബക്കർ മുസ്ലിയാർ, കൂട്ടായി ബാവ മുസ്ലിയാർ' ,students: '',services:'' ,designation:'' ,writings: '',death: '1998 ജൂലൈ 31 റബീഉൽ അവ്വൽ 29',tomb: 'വടകര ചെറുവണ്ണൂർ',degree: ''),
ItemClass(title: 'തഴവാ മുഹമ്മദ് കുഞ്ഞി മൗലവി', imagePath: 'images/thazva kunjimuhammed moulavi.jpg',name:'തഴവാ മുഹമ്മദ് കുഞ്ഞി മൗലവി' ,birth: '1921 ഓഗസ്റ്റ് 10',place:'' ,teachers:'കോടഞ്ചേരി അബ്ദുറഹിമാൻ മുസ്ലിയാർ - ഇബ്റാഹിം മുസ്ലിയാർ കിടങ്ങയം - ഹമീദ് മൗലവി കക്കാഴം' ,students: '',services:'' ,designation:'' ,writings: 'മസ്ലക്കുൽ ആബിദീൻ -മള്ഹറുൽ അതുബ്ബി ബി ബർസഖിൽ മനാഖിബു ഹസനുബ്നു അലിയ്യുൽ കരുനാഗപള്ളി - നിബ്രാസുൽ അലിയ്യി ഫീ മനാഖിബി ഹള്റമിയ്യി ജോനകപ്പുറം',death: '1999 ജൂൺ13 സ്വഫർ 29',tomb: 'തഴ്‌വാ മാർക്കറ്റ് മസ്ജിദ്',degree: ''),
ItemClass(title: 'കീഴന കുഞ്ഞബ്ദുല്ല മുസ്ലിയാർ', imagePath: 'images/ulam.jpg',name:'കീഴന കുഞ്ഞബ്ദുല്ല മുസ്ലിയാർ' ,birth: '1087 കർക്കിടകം 22',place:'' ,teachers:'തറക്കണ്ടി അബ്ദുറഹിമാൻ മുസ്ലിയാർ,  അല്ലാമാ ശീറാസി, ഖുതുബി മുഹമ്മദ് മുസലിയാർ, ചേരാപുരം ചെറിയമ്മദ് മുസ്ലിയാർ' ,students: 'അരിക്കൽ അബ്ദുറഹ്മാൻ മുസ്ലിയാർ, അരിക്കൽ ഇബ്റാഹം മുസ്ലിയാർ, ചേലക്കാട് അഹമ്മദ് മുസ്ലിയാർ, അബ്ദുൽ ഖാദർ മുസ്ലിയാർ, ആയഞ്ചേരി അഹമദ് കുട്ടി മുസ്ലിയാർ, കെ.മൊയ്തു മൗലവി',services:'' ,designation:'' ,writings: '',death: '2000 ഒക്ടോബർ 13',tomb: 'കടമേരി കോളേജ് ക്യാമ്പസ് മസ്ജിദ്',degree: ''),
ItemClass(title: 'മുഹമ്മദലി ശിഹാബ് തങ്ങൾ', imagePath: 'images/sayyid muhammed ali shihab thangal.jpg',name:'പാണക്കാട് സയ്യിദ് മുഹമ്മദലി ശിഹാബ് തങ്ങൾ' ,birth: '1936 മെയ് 4',place:'പാണക്കാട്' ,teachers:'ഡോ ഇസ്സുദ്ധീന്‍ ഫരീദ്, യൂസുഫ് ഖുലൈഫ്, ഡോ ബഹി, ശൗഖിളൈഫ്' ,students: '',services:'' ,designation:'മുസ്ലിം ലീഗ സംസ്ഥാന പ്രസിഡന്റ്' ,writings: '',death: '2009 ആഗസ്റ്റ് 1 (ശഅ്ബാന്‍ 10)',tomb: 'പാണക്കാട് ജുമാ മസ്ജിദ്',degree: ''),
ItemClass(title: 'പൂക്കോയ തങ്ങൾ പാനൂർ', imagePath: 'images/ulam.jpg',name:'പൂക്കോയ തങ്ങൾ പാനൂർ' ,birth: '1936',place:'' ,teachers:'അബ്ദുറഹ്മാൻ മുസ്ലിയാർ, സയ്യിദ് അബ്ദുറഹ്മാൻ ഉള്ളാൾ തങ്ങൾ, ഇ കെ അബൂബക്കർ മുസ്ലിയാർ, അബ്ദുറഹിമാൻ ഫള്ഫരി എന്ന കുട്ടി മുസ്ലിയാർ' ,students: '',services:'ഏലത്തൂർ, പയ്യോളി, ഒളവട്ടൂർ, പാറക്കടവ്, ചെറുകുന്ന്, ഓമച്ചപ്പുഴ, തളിപ് തുടങ്ങിയ സ്ഥലങ്ങളിൽ മുർദിസായി സേവനമനുഷ്ഠിച്ചു' ,designation:'' ,writings: 'അലാ ഹാമിശി ത്തഫാസീർ, അദബുൽ മുസ്ലിം ഫീ മൻഹജിൽ ഇസ്ലാം, സ്വഫ്‌വത്തുൽ കലാം ഫീ അഖീദത്തിൽ ഇസ്ലാം, അന്നിബ്റാസ് ഫീ മസക്കിൽ ഇമാം ശാഫിഈ, അൽ മൻഥിഖ് ഫീ ശറഹിഹ്ദീബ്',death: '2010 മെയ് 10',tomb: '',degree: 'ഖാസമി'),
ItemClass(title: 'പ്രൊഫ. ഇ. മുഹമ്മദ്‌', imagePath: 'images/ulam.jpg',name:'പ്രൊഫ. ഇ. മുഹമ്മദ്‌' ,birth: '1    ജൂലൈ  1944',place:'' ,teachers:'വാളക്കുളം  അബ്ദുൽബാരി മുസ്ലിയാർ, കോട്ടുമല അബൂബക്കർ മുസ്ലിയാർ, അലവിക്കുട്ടി മുസ്‌ലിയാർ, കുഞ്ഞായിൻ മുസ്ലിയാർ' ,students: '',services:'പി.എസ്. എം. ഒ കോളേജ് തിരൂരങ്ങാടി, ഫാറൂഖ് ഇംഗ്ലീഷ് മീഡിയം ഹൈസ്കൂൾ, ദാറുൽ ഹുദാ ഇസ്ലാമിക് യൂണിവേഴ്സിറ്റി ചെമ്മാട്' ,designation:'പി. എസ്. എം. ഒ കെമിസ്ട്രി വിഭാഗം തലവൻ, ദാറുൽ ഹുദാ സെക്രട്ടറി,ഫാറൂഖ് എഡ്യൂക്കേഷണൽ സൊസൈറ്റി സെക്രട്ടറി,പുതുപ്പറമ്പ് മഹല്ല് കമ്മിറ്റി പ്രസിഡന്റ്, ആതവനാട് മർക്കസ് എക്സിക്യൂട്ടീവ് മെമ്പർ,  സുന്നി മഹൽ ഫെഡറേഷൻ മെമ്പർ, സമസ്ത എംപ്ലോയീസ് അസോസിയേഷൻ മെമ്പർ' ,writings: '',death: '2010',tomb: '',degree: ''),
ItemClass(title: 'തൃപ്പനച്ചി ഉസ്താദ്', imagePath: 'images/thrppanachi mhd musliyar.jpg',name:'തൃപ്പനച്ചി മുഹമ്മദ് മുസ്‌ലിയാർ' ,birth: '1931',place:'തൃപ്പനച്ചി' ,teachers:'അരിമ്പ്ര അബൂബക്കർ മുസ്‌ലിയാർ, ഒ കെ സൈനുദ്ധീൻ മുസ്‌ലിയാർ, മുണ്ടമ്പ്ര അഹ്മദ് കുട്ടി മുസ്‌ലിയാർ' ,students: '',services:'' ,designation:'' ,writings: '',death: '2011 ഡിസംബർ 26',tomb: 'തൃപ്പനച്ചി',degree: ''),
ItemClass(title: 'മമ്മദ് ഫൈസി', imagePath: 'images/haji k mammed faisy.jpg',name:'ഹാജി കെ മമ്മദ് ഫൈസി' ,birth: '1949',place:'മലപ്പുറം, തിരൂർക്കാട്' ,teachers:'അരിപ്ര കക്കാട്ടിൽ മുഹമ്മദ് മുസ്ലിയാർ,ആനമങ്ങാട് പി കെ അബ്ദുറഹ്മാൻ മുസ്ലിയാർ, സഹോദരൻ ആലിക്കുട്ടി മുസ്ലിയാർ,ശംസുൽ ഉലമ ഇ. കെ ഉസ്താദ്, കോട്ടുമല അബൂബക്കർ മുസ്ലിയാർ' ,students: '',services:'' ,designation:'SYSസംസ്ഥാന ട്രഷറർ, SKIMVB എക്സിക്യൂട്ടിവ് അംഗം, ജാമിഅ നുരിയ്യ സെക്രട്ടറി, സമസ്ത ലീഗൽ സെൽ ചെയർമാൻ, കേരള പ്രവാസി ലീഗ് ചെയർമാൻ,. SMF, SKMMA, മുസ്ലീം ലീഗ് സംസ്ഥാന കമ്മറ്റി അംഗം,SKIMVB ഇൻസ്പെക്ഷൻ കൺവീനർ, സമസ്ത മലപ്പുറം ജില്ല ജോ.സെക്രട്ടറി,തിരൂർക്കാട് മഹല്ല് പ്' ,writings: '',death: 'ഹിജ്റ 1438 ശവ്വാൽ 11(2017 ജൂലൈ 6)',tomb: 'തിരൂർക്കാട് ജുമാ മസ്ജിദ്',degree: 'ഫൈസി'),
ItemClass(title: 'ഹൈദർ മുസ്ലിയാർ തൃകണപുരം', imagePath: 'images/hyder musliyar thrkanapuram.jpg',name:'ഹൈദർ മുസ്ലിയാർ തൃകണപുരം' ,birth: 'ഹിജ്റ 1365 റജബ് 26( 1947 ജൂൺ 15)',place:'മലപ്പുറം ജില്ലയിലെ കുറ്റിപ്പുറത്തിനടുത്ത് തവനൂർ ഗ്രാമപഞ്ചായത്തിലെ ത ക്കണാപുരം ദേശത്ത് കച്ചേരിപ്പറമ്പ്' ,teachers:'റഈസുൽ മുഹഖിഖീൻ കണ്ണിയത്ത് അഹമദ് മുസ്ല്യാർ, ശംസുൽ ഉലമ ഇ.കെ അബൂബക്കർ മുസ്ലിയാർ, കോട്ടുമല അബൂബക്കർ മുസ്ല്യാർ, എ. പി മുഹമ്മദ് മുസ്ല്യാർ കുമരംമ്പത്തൂർ, പാറപ്പുറം മുഹമ്മദ് ഹാജി, മാത്തൂർ യു.പി മുഹമ്മദ് മുസ്ല്യാർ ,കക്കിടിപ്പുറം അബൂബക്കർ മുസ്ല്യാർ, തൃപ്പനച്ചി മുഹമ' ,students: 'റഹീം മുസ്ല്യാർ കാരക്കാട്, മുഹമ്മദ് ഫൈസി പുതുപൊന്നാനി, അലി ദാരിമി കാലടി, അബ്ദുറഹമാൻ അഹ്സനി കക്കിടിപ്പുറം , അബ്ദുറഹ്മാൻ ദാരിമി , യൂസു ഫ് അഹ്സനി കാവനൂർ, അബ്ദുറഹ്മാൻ മുസ്ലിയാർ തണ്ടലം, റസാഖ് മുസ്ലി യാർ വെണ്ടല്ലൂർ',services:'' ,designation:'വളവന്നൂർ പഞ്ചായത്ത് എസ് എം എഫ് പ്രസിഡണ്ട്,പൊന്നാനി താലൂക്ക് സമസ്ത ട്രഷറർ കോട്ടക്കുന്ന് മഹല്ല്, കച്ചേരിപറമ്പ് നിസ്കാര പള്ളി- മദ്റസ തുടങ്ങിയ സ്ഥാപനങ്ങളുടെ , പുള്ളുവൻ പടി തുടങ്ങിയ' ,writings: '',death: 'ഹിജ്റ 1443 റജബ് 10 (ക്യൂ 11 ഫെബ്രുവരി 2022)',tomb: 'കോട്ടക്കുന്ന് മഹല്ല് പള്ളി.',degree: ''),
ItemClass(title: 'നിസാമി ഉസ്താദ്', imagePath: 'images/syd muhammed nisami.jpg',name:'സെയ്തു മുഹമ്മദ് നിസാമി' ,birth: '1948',place:'കോഴിക്കോട്, ബേപ്പൂർ' ,teachers:'കണ്ണിയത്ത് അഹമ്മർ മുസ്ലിയാർ,സി.എച്ച് ഹൈദ്രസസ് മുസ്ലിയാർ,ഒ.കെ സൈനുദ്ധീൻ മുസ്‌ലിയാർ' ,students: '',services:'' ,designation:'SKIMVB കൗൺസിലർ,CIC അക്കാദമിക്ക് ഡയറക്ടർ' ,writings: 'ഇസ്ലാമിക വിശ്വാസം ശാസ്ത്ര ദൃഷ്ടിയിൽ,ഖുർആനും ശാസ്ത്രീയ സത്യങ്ങളും,  ഇസ്ലാമിക വിശ്വസപ്രമാണം, അവരുടെ കൂട്ടിക്കാലം, ഞങ്ങൾ ഇസ്ലാമിലേക്ക്,കുട്ടികളുടെ ലോകം, വ്രതം ഒരു പഠനം, ആധുനിക യുഗത്തിന്റെ ചലനങ്ങൾ,  ചരിത്ര വനിതകൾ, ആലോചകങ്ങൾ',death: '',tomb: '',degree: ''),
ItemClass(title: 'മേനക്കോത്ത് മുസ്ലിയാർ', imagePath: 'images/ulam.jpg',name:'മേനക്കോത്ത് കുഞ്ഞഹമ്മദ് കുട്ടി മുസ്ലിയാർ' ,birth: 'ഹി 1233',place:'' ,teachers:'ശൈഖ് അലിയ്യുബ്നു അഹ്മദുൽ ഹമദാനി,വെളിയങ്കോട് ഉമർ ഖാളി, വലിയ ബാവ മുസ്‌ലിയാർ, സൈനുദ്ദീൻ മഖ്ദൂം അഖീർ' ,students: 'നുഞ്ഞേരി കുഞ്ഞഹമ്മദ് ശൈഖ്, ഫരീദ് മുസ്‌ലിയാർ, ശൈഖ് മുഹമ്മദുൽ ഹമദാനി',services:'' ,designation:'' ,writings: '',death: '1780 (ഹി 1290 റബീഉൽ അവ്വൽ 17)',tomb: 'നാദാപുരം പള്ളി',degree: ''),
ItemClass(title: 'അവുക്കോയ മുസ്ലിയാർ', imagePath: 'images/ulam.jpg',name:'അവുക്കോയ മുസ്ലിയാർ' ,birth: 'ഹി 1222',place:'പരപ്പനങ്ങാടി' ,teachers:'അല്ലാമാ അഹ്മദുൽ മഖ്ദൂം, അല്ലാമാ മുഹമ്മദുൽ ഹമദാനി, സയ്യിദ് ബലാഫതനി,വെളിയങ്കോട് ഉമർ ഖാളി' ,students: '',services:'താനൂർ വലിയ കുളങ്ങര, തിരൂരങ്ങാടി നടുവിലെ പള്ളി, പരപ്പനങ്ങാടി പനയത്തിൽ  ജുമുഅത് പള്ളി തുടങ്ങിയ സ്ഥലങ്ങളിൽ  മുദരിസ്' ,designation:'' ,writings: '',death: '1875 (ഹി 1292)',tomb: 'പരപ്പനങ്ങാടി പള്ളി',degree: ''),
ItemClass(title: 'പാടൂര്‍ കോയക്കുട്ടി', imagePath: 'images/ulam.jpg',name:'സയ്യിദ് ഫഖ്റുദ്ദീന്‍ അല്‍ ബുഖാരി എന്ന പാടൂര്‍ കോയക്കുട്ടി' ,birth: '',place:'വെട്ടത്ത് പുതിയങ്ങാടി കോട്ടത്തറ' ,teachers:'' ,students: '',services:'' ,designation:'' ,writings: 'മനാസികുല്‍ മലൈബാരി ഫീ ഹജ്ജി ബൈത്തില്ലാഹില്‍ ബാരി,രിസാലത്തുല്‍ ഉല്‍വ്വിയ്യ,  റദ്ദുല്‍ മതീന്‍ ഫീ ഫത്മി മത്‌നി ബദ്‌രില്‍ മുബീന്‍, തിര്‍യാഖുശ്ശിഫാ, ഫവാഇദുല്‍ ഉനാസ്, സൈഫുല്‍ മുളീഅ്',death: '1881 (ഹി 1298 റബീഉല്‍ ആഖിര്‍ 3)',tomb: ' മസ്ജിദുല്‍ വുസ്താ പാടൂര്‍',degree: ''),
ItemClass(title: 'സൈനുദ്ദീന്‍ റംലി', imagePath: 'images/ulam.jpg',name:'സൈനുദ്ദീന്‍ റംലി എന്ന മണലില്‍ സൈനുദ്ദീന്‍ മുസ്ലിയാർ' ,birth: 'ഹിജ്‌റ 1249',place:'' ,teachers:'പരപ്പനങ്ങാടി ഔക്കോയ മുസ്‌ലിയാര്‍, വെളിയങ്കോട് ഉമര്‍ ഖാദി, അല്ലാമാ അബ്ദുല്‍ ഹമീദ് ശര്‍വാനി മക്കി, ശൈഖ് അഹമ്മദ് സൈനി ദഹ്ലാന്‍, മുഹമ്മദ് ഹിസ്ബുല്ലാഹില്‍ മക്കി' ,students: 'പുത്തന്‍പള്ളി കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, എരമംഗലം ഹിശാം മുസ്‌ലിയാര്‍, തട്ടാങ്ങര കുട്ട്യാമു മുസ്‌ലിയാര്‍,  കുഞ്ഞന്‍ ബാവ മുസ്‌ലിയാര്‍, ശൈഖ് സിറാജുദ്ദീന്‍ ഖാദിരി, അഹമ്മദ് ബാവ മുസ്‌ലിയാര്‍, ശൈഖ് അലി ഹസന്‍  എന്ന കോയക്കുട്ടി മുസ്‌ലിയാര്‍, ചുളളിയില്‍ അബൂബക്കര്‍ മുസ്‌ലിയാര്‍, കോടഞ്ചേരി അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, വളപ്പില്‍ അബ്ദുല്‍ അസീസ് മുസ്‌ലിയാര്‍, കുറ്റൂര്‍ കമ്മുണ്ണി മുസ്‌ലിയാര്‍, പുന്നയൂര്‍കുളം അഹമ്മദ് മുസ്‌ലിയാര്‍, കോക്കൂര്‍ കുഞ്ഞഹമ്മദ് മുസ്‌ലിയാര്‍, ഖാദി അബ്ദുള്ള മുസ്‌ലിയാര്‍ കാസര്‍ഗോഡ്, ശുജാഇ മൊയ്തു മുസ്‌ലിയാര്‍, അണ്ടത്തോട് അമ്മു മുസ്‌ലിയാര്‍, ഞമനേക്കാട് ഏനി കുട്ടി മുസ്‌ലിയാര്',services:'തിരൂരങ്ങാടി നടുവിലെ പള്ളി, പൊന്നാനി മഖ്ദൂം പള്ളി എന്നിവിടങ്ങളിൽ ദർസ് നടത്തി' ,designation:'' ,writings: '',death: '1891 (ഹിജ്‌റ 1309 ജമാദുല്‍ ആഖിര്‍)',tomb: 'നൂനക്കടവ് ജുമാമസ്ജിദ്',degree: ''),
ItemClass(title: 'താനൂർ അബ്ദുറഹ്മാൻ ശൈഖ്', imagePath: 'images/ulam.jpg',name:'താനൂർ അബ്ദുറഹ്മാൻ മുസ്ലിയാർ' ,birth: 'ഹി 1257',place:'' ,teachers:'സൈനുദ്ദീൻ മുസ്‌ലിയാർ, വലിയ അഹ്മദ് എന്ന ബാവ മുസ്‌ലിയാർ,  പരപ്പനങ്ങാടി ഔക്കോയ മുസ്ലിയാർ' ,students: 'യുസുഫ് മുസ്‌ലിയാർ,വാളക്കുളം നരിമടക്കൽ അഹ്മദ് കുട്ടി ഹാജി, മുഹമ്മദ് മുസ്ലിയാർ',services:'വലിയകുളങ്ങര പള്ളിയിൽ മുദരിസ്' ,designation:'' ,writings: 'അവാരിഫുല്‍ മആരിഫ്, ഇഫാദത്തുല്‍ ഖുദുസിയ്യ ഫീ ഇഖ്തിലാഫി ത്വറഫി സ്സൂഫിയ്യ, അസ്‌റാറുല്‍ മുഹഖിഖീന്‍ ഫീ മഅ്‌രിഫത്തി റബ്ബില്‍ ആലമീന്‍',death: 'ഹി: 1322 ശവ്വാല്‍ 22',tomb: '',degree: ''),
ItemClass(title: 'ശൈഖ് അലിയ്യുത്തൂരി', imagePath: 'images/ulam.jpg',name:'ശൈഖ് അലിയ്യുത്തൂരി എന്ന അലി മുസ്ലിയാര്‍ കട്ടിലശ്ശേരി' ,birth: '1850(ഹി1266)',place:'മലപ്പുറം,കൊളത്തൂര്' ,teachers:'മഖ്ദൂം അഖീര്‍, പൊന്നാനി വലിയ ബാവ മുസ്‌ലിയാര്‍, ചെറിയ ബാവ മുസ്ലിയാര്‍,അഹ്മദ് സൈനീ ദഹ്ലാന്‍, മുഹമ്മദ് ഹസ്ബുല്ലാഹില്‍ മക്കി' ,students: 'യൂസുഫുല്‍ ഫള്ഫരി, ചെറുശ്ശേരി അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, അരിപ്ര മൊയ്തീന്‍ ഹാജി, പാങ്ങില്‍ അഹമ്മദ് കുട്ടി മുസ്‌ലിയാര്‍, വെള്ളേങ്ങര മുഹമ്മദ് മുസ്ലിയാര്‍, പാതിരമണ്ണ കുഞ്ഞീദു മുസ്ലിയാർ',services:'പെന്നാനി,പുളിക്കല്‍, വറ്റലൂര്‍, കരിഞ്ചാപ്പാടി എന്നിവിടങ്ങളിൽ ദർസ് നടത്തി' ,designation:'' ,writings: '',death: '1916 (ഹി 1334 റജബ് 26 )',tomb: 'കരിഞ്ചാപ്പാടി ജുമുഅത്ത് പള്ളി',degree: ''),
ItemClass(title: 'മംഗലം മുഹമ്മദ് മുസ്ലിയാർ', imagePath: 'images/mangalam usthad.jpg',name:'മംഗലം മുഹമ്മദ് മുസ്ലിയാർ' ,birth: '1935',place:'തിരൂർ മംഗലം' ,teachers:'' ,students: '',services:'കാസർകോഡ് , കുറ്റ്യാടി, പുത്തനത്താണി, വെട്ടം, എടക്കനാട് , കാവഞ്ചേരി, തുടങ്ങിയ സ്ഥലങ്ങളിലായി പതിറ്റാണ്ടുകളോളം ദർസ് നടത്തി' ,designation:'' ,writings: '',death: '2002 വഫാത്ത്',tomb: 'ജന്നതുൽ ബഖീഇൽ',degree: 'ഖാസിമി'),
ItemClass(title: 'സൈതലവി മുസ്ലിയാർ', imagePath: 'images/kalaav saithalavi musliyar.jpg',name:'കാളാവ് സൈതലവി മുസ്ലിയാർ' ,birth: '1947',place:'മഞ്ചേരി നെല്ലിക്കുത്ത്' ,teachers:'' ,students: '',services:'കർണാടകയിലെ കൊടുക്, ഉടുക്കേരി, തൃശൂർ വടക്കേ പുന്നിയൂർ എന്നിവിടങ്ങളിൽ സേവനം ചെയ്തു. അബുദാബിയിൽ ദേരാ ദുബൈ മസ്ജിദിൽ ചീഫ് ഇമാം , സൈനിക മന്ത്രാലയം മസ്ജിദ് ചീഫ് ഇമാം , ഔഖാഫ് മസ്ജിദ് എന്നിവിടങ്ങളിൽ   സേവനം ചെയ്തു' ,designation:'സമസ്ത മലപ്പുറം ജില്ലാ മുശാവറ അംഗം, സമസ്ത പ്രവാസി സെൽ കൺവീനർ, അബുദാബി സുന്നി സെന്റർ പ്രസിഡന്റ്, SMF മലപ്പുറം ജില്ലാ വർക്കിംഗ് പ്രസിഡന്റ്, SYS മലപ്പുറം ജില്ലാ വൈസ് പ്രസിഡന്റ്, ദാറുൽ ഹുദാ അഡ്വൈസറി ബോർഡ് ചെയർമാൻ, താനൂർ ഇസ്ലാഹുൽ ഉലും പ്രസിഡന്റ്, വയനാട് മുട്ടിൽ' ,writings: '',death: 'ഹിജ്റ 1442 റബീഉൽ ആഖിർ 6 (2020 നവംബർ )',tomb: '',degree: ''),
ItemClass(title: 'ടി.സി അബ്ദുല്ല മുസ്ലിയാർ', imagePath: 'images/tc abdulla musliyar (2).jpg',name:'ടി.സി അബ്ദുല്ല മുസ്ലിയാർ' ,birth: '',place:'കോഴിക്കോട്, വെണ്ണക്കോട്' ,teachers:'' ,students: '',services:'നെല്ലിക്കുത്ത്, മൂരിയാട്, വെള്ളിപറമ്പ്, പറമ്പില്‍ പള്ളി എന്നിവിടങ്ങളിൽ സേവനം ചെയ്തു' ,designation:'' ,writings: '',death: '2020 ഒക്ടോബര്‍ 4',tomb: 'ആലിന്‍തറയിലെ അല്‍ ജാമിഅ അല്‍ ഹനീഫിയ്യ',degree: 'ഫൈസി'),

ItemClass(title: 'ഖാളി അഹമ്മദ്ശിഹാബുദ്ധീൻ മുസ്ലിയാർ', imagePath: 'images/ahmed shihabuddeen faisy kappad qasi.jpg',name:'കാപ്പാട് ഖാളി പി കെ അഹമ്മദ്ശിഹാബുദ്ധീൻ മുസ്ലിയാർ' ,birth: '',place:'' ,teachers:'ശംസുൽ ഉലമ, കോട്ടുമല ഉസ്താദ്, താഴക്കോട് കുഞ്ഞലവി മുസ്ലിയാർ ഒ.കെ ഉസ്താദ്' ,students: '',services:'പുറക്കാട് ജുമുഅത്ത് പള്ളി, ചീക്കിലോട് എന്നിവിടങ്ങളിൽ  മുദരിസ്' ,designation:'കാപ്പാട് ഖാളി,സമസ്ത കോഴിക്കോട് ജില്ലാ മുശാവറ മെമ്പർ' ,writings: '',death: '2023 മെയ് 21',tomb: '',degree: ''),

ItemClass(title: 'നെടുങ്ങോട്ടൂർ മുസ്ലിയാർ', imagePath: 'images/nedungottur usthad.jpg',name:'നെടുങ്ങോട്ടൂർ പി കുഞ്ഞഹമ്മദ് മുസ്ലിയാർ' ,birth: '',place:'' ,teachers:'സ്വദഖതുള്ള മുസ്‌ലിയാർ,കെ.കെ. ഉസ്താദ്' ,students: '',services:'കണിയാപുരം,പെരുമ്പാവൂർ കണ്ടന്തറ, കുഞ്ഞുണ്ണിക്കര, പുതിയകാവ്, സാഹിബിന്റെ പള്ളി (തൃശ്ശൂർ), കൊപ്പം, നാട്യമംഗലം,വളാഞ്ചേരി മർക്കസ എന്നിവിടങ്ങളിൽ  മുദരിസായിരുന്നു' ,designation:'സമസ്ത പാലക്കാട് ജില്ലാ ഉപാദ്ധ്യക്ഷൻ' ,writings: '',death: '2023 ജൂൺ 10',tomb: '',degree: 'ബാഖവി'),
ItemClass(title: 'അലി മുസ്ലിയാർ', imagePath: 'images/ulam.jpg',name:'അലി മുസ്ലിയാർ' ,birth: '1961',place:'ഇരിങ്ങല്ലൂർ' ,teachers:'കുണ്ടൂർ അബ്ദുൽ കാദിർ മുസ്ലിയാർ,ഇ.സുലൈമാൻ മുസ്ലിയാർ' ,students: '',services:'കോറാട്,കുണ്ടൂർ,ചെനക്കൽ ,ദാറുൽ മഅരിഫ് വലിയോറ ,ദാറുൽ ഹുദാ ഇസ്ലാമിക് യൂൺവേഴ്സിറ്റി എന്നീ സ്ഥലങ്ങളിൽ  സേവനം ചെയ്തു' ,designation:'SYS പഞ്ചായത്ത് പ്രസിഡന്റ്,നുസ്റത്തുൽ ഇസ്ലാം സംഘം പ്രസിഡന്റ്' ,writings: '',death: '26 - 4 -2023 ശവ്വാൽ 5',tomb: 'ഇരിങ്ങല്ലൂർ പാലാണി ജുമാ മസ്ജിദ്',degree: ''),

      // ... Your sample data ...
    ];
    // Initialize filteredItems with all items
    filteredItems = List.from(items);
  }

  void _filterItems(String query) {
    // Filter items based on the query
    setState(() {
      filteredItems = items
          .where((item) =>
              item.title.toLowerCase().contains(query.toLowerCase()) ||
              item.name.toLowerCase().contains(query.toLowerCase()))
          .toList();
    });
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        iconTheme: IconThemeData(color: Colors.white),
        backgroundColor: Color.fromARGB(255, 97, 135, 110),
        title: Text(
          'മറ്റു ശ്രദ്ധേയ വ്യക്തിത്വങ്ങൾ',
          style: TextStyle(
            fontFamily: 'Pacifico',
            fontSize: 16.0,
            fontWeight: FontWeight.bold,
            color: Colors.white,
          ),
        ),
        actions: <Widget>[
          // Toggle between search icon and text field
          Padding(
            padding: const EdgeInsets.all(8.0),
            child: isSearching
                ? Container(
                    width: 300.0,
                    child: TextField(
                      onChanged: _filterItems,
                      decoration: InputDecoration(
                        hintText: 'search',
                        hintStyle: TextStyle(color: Colors.white),
                      ),
                    ),
                  )
                : IconButton(
                    onPressed: () {
                      setState(() {
                        isSearching = true;
                      });
                    },
                    icon: Icon(Icons.search,color: Colors.white,),
                  ),
          ),
        ],
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            // Display filtered cardWidgets
            for (int i = 0; i < filteredItems.length; i += 3)
              Row(
                children: [
                  if (i < filteredItems.length)
                    cardWidget(sample: filteredItems[i]),
                  if (i + 1 < filteredItems.length)
                    cardWidget(sample: filteredItems[i + 1]),
                  if (i + 2 < filteredItems.length)
                    cardWidget(sample: filteredItems[i + 2]),
                  // Fill empty spaces with SizedBox
                  if (i + 1 >= filteredItems.length) SizedBox(width: 120.0),
                  if (i + 2 >= filteredItems.length) SizedBox(width: 140.0),
                ],
              ),
          ],
        ),
      ),
    );
  }
}
