import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      home: pankudumbam(),
    );
  }
}

class pankudumbam extends StatefulWidget {
  @override
  _pankudumbamState createState() => _pankudumbamState();
}

class _pankudumbamState extends State<pankudumbam> {
  List<BlogPost> allPosts =  [
    BlogPost(
      title: 'കോഴിക്കോട് ഖാളി കുടുംബം',
      content:
          '''
കേരളത്തിൽ ഇസ്ലാമിന്റെ ആഗമനത്തിന് വഴി തെളിയിച്ച
 മാലിക് ബിൻ ദീനാർ(റ)വിന്റെ സഹോദരപുത്രൻ മാലിക് ബിൻ ഹബീബ്(റ), കോഴിക്കോട് ചാലിയത്ത് ഹി.1111 ക്രി.736 ലും പന്തലായനിയിൽ ഹി.122/ ക്രി.139 ലും പ കൾ സ്ഥാപിക്കുകയും പൗത്രൻ സൈനുദ്ദീൻ ബിൻ മദനി റ)യെ ചാലിയത്തേയും തന്റെ മകൻ സൈനുദ്ദീൻ ബിൻ മാലി കി(റ)നെ പന്തലായനിയിലേയും ഖാദിമാരായി നിയമി ക്കുകയും ചെയ്തു. സൈനുദ്ദീൻ ബിൻ മദനി(റ) മുതലാണ് കോഴിക്കോട് ഖാദി കുടുംബത്തിന്റെ ചരിത്രം ആരംഭിക്ക ന്നത്. കാലങ്ങളോളം കോഴിക്കോട്ടും പരിസരത്തും നിലനി ന്നത് ചാലിയം ഖാദിമാരായിരുന്നു. ഏറെ കഴിഞ്ഞതിന് ശേഷ മാണ് കോഴിക്കോട് ഖാദി എന്ന സ്ഥിരമായ പദവി വരു ന്നത്. ചാലിയത്ത് നിന്ന് പുതിയങ്ങാടിയിലേക്കും അവിടെ നിന്ന് ഇന്നത്തെ കോഴിക്കോട്ടേക്കും പട്ടണം നീങ്ങിയതിനു സരിച്ച് ഖാദിയുടെ ആസ്ഥാനത്തിനും മാറ്റങ്ങളുണ്ടായി. പ്രാദേശിക വിധികർത്താക്കളും ഖാദിമാരും ഉണ്ടായെങ്കിലും മലബാറിലെ അനേകം മഹല്ലുകളുടെ അധികാരവും മേൽക്കോയും കോഴിക്കോട്ടെ ഖാദിക്ക് തന്നെയായിരുന്നു.ക്രി.1571 ൽ ചാലിയം കോട്ട പിടിച്ചെടുക്കാനായി പോർച്ചു ഗീസുകാർ നടത്തിയ യുദ്ധത്തെ തുടർന്ന് ചാലിയം പള്ളിയും നശിപ്പിക്കപ്പെട്ടിരുന്നു. ഖാദിമാരെക്കുറിച്ചുള്ള വിവരങ്ങളുട ങ്ങിയ എല്ലാ രേഖകളും ഇക്കാലത്ത് നശിപ്പിക്കപ്പെട്ടതിനാൽ വളരെ പരിമിതമായ അറിവ് മാത്രമേ കോഴിക്കോട് ഖാദി മാരെ കുറിച്ച് ലഭ്യമായിട്ടുള്ളൂ. ഈ ഉറവിടങ്ങളിൽ പ്രധാനംകോഴിക്കോട് ഖാദിമാരിൽ പ്രഗത്ഭനായിരുന്ന അബൂബക്ർ കുഞ്ഞി ഖാദിയുടെ ശർഹു തീസിൽ വിരിയ്യയാണ്.ഇബ്നു ബത്തൂത്തയുടെ സന്ദർശന വേളയിൽ ഇവി ടത്തെ ഖാദി ഫഖ്റുദ്ദിൻ ഉസ്മാനിയായിരുന്നുവെന്ന് അദ്ദേഹം തന്റെ യാത്രാവിവരണ ഗ്രന്ഥമായ തുഹ്ഫത്തു ന്നുള്ളാർ ഫീ ഗറാഇബിൽ അംസ്വാർ വാബിൽ അസ്ഫാറിൽ രേഖപ്പെടുത്തുന്നു. ഇദ്ദേഹത്തിന്റെ സന്ദർശ നത്തിന് മുമ്പേ നാല്പതോളം പേർ ചാലിയം ആസ്ഥാന മാക്കി ഖാദിമാരായിട്ടുണ്ടെന്ന് ഊഹിക്കപ്പെടുന്നു. സൈനു ദ്ദീൻ ബിൻ മദനി(റ), ജാഫർ ബിൻ സുലൈമാൻ (റ), മുഹ മ്മദ് ബിൻ മദനി അൽ അൻസാരി (റ), മാലിക് ബിൻ മുഹ മ്മദ്(റ), ഹബീബ് ബിൻ മാലിക് (റ), മാലിക് ബിൻ ഹബീ ബ്(റ), മുഹമ്മദ് ബിൻ മാലിക് (റ) തുടങ്ങിയവർ ഇതിൽ പ്രധാനികളാണ്.മാലിക് ബിൻ ദീനാർ(റ) പ്രാദേശിക രാഷ്ട്രീയനേതാക്ക ളുടെയും രാജാവിന്റെയും സഹകരണത്തോടെയാണ് ഇസ്ലാ മിക പ്രവർത്തനത്തിന് നേതൃത്വം നൽകിപ്പോന്നത്. അവർക്ക് രാജകൊട്ടാരത്തിൽ പ്രത്യേക സ്ഥാനമാനങ്ങളും ശമ്പളവും ആനുകൂല്യങ്ങളും നൽകപ്പെട്ടിരുന്നു. മുസ്ലിം കുറ്റവാളി കൾക്ക് ഖാദി കൽപിക്കുന്ന ശിക്ഷയായിരുന്നു നൽകിയിരുന്നത്. മതനിയമങ്ങൾ ഖാദിയുടെ അനുവാദത്തോട് കൂടി മാത്രമേ നടപ്പാക്കിയിരുന്നുള്ളൂ. പിൽക്കാലത്ത് രാജകീയ പ്രതാപം അവസാനിച്ചപ്പോൾ ബ്രിട്ടീഷ് സർക്കാർ ഈ ആനു കൂല്യങ്ങളും സമ്പ്രദായങ്ങളും എടുത്തുമാറ്റി. മുസ് ലിം ഖാദിയെ നിയമിക്കാൻ മുസ്ലീം സമുദായത്തിനു തന്നെ അധികാരം നൽകി.''',
    ),
    BlogPost(
      title: 'മഖ്ദൂം കുടുംബം',
      content:
          'സേവനം ചെയ്തു എന്നർത്ഥം ലഭിക്കുന്ന ഖദമ എന്ന അറബി പദത്തിൽനിന്നും നിഷ്പന്നമായതാണ് മഖ്ദൂം എന്ന പദം എന്ന് പറയപ്പെടുന്നു. സേവനം ചെയ്യപ്പെടുന്നവൻ എന്നാണിതിന്റെ താത്പര്യം.മഖ്ദൂമുമാർ കേരളത്തിലെത്തിയത് ഈജിപ്തിൽ നിന്നാണെന്ന് കായൽപട്ടണത്തെക്കുറിച്ച് പഠനം നടത്തിയ ഡോ. അബ്ദുല്ലത്തീഫ് സ്ഥിരീകരിക്കുന്നുണ്ട്. പ്രധാനമായും രണ്ട് ഘട്ടങ്ങളിലായിരുന്നു മഖ്ദൂമുമാരുടെ പലായനം. ആദ്യമായി ഹി.227/ ക്രി.842 ൽ ഈജിപ്തിലെ കൈറോവിൽ ഖിറാഫത്തുൽ കുബ്റാ എന്ന പട്ടണത്തിലെ മുഖദ്ദം പർവത താഴ്വരയിൽ നിന്ന് മുഹമ്മദ് ഖിൽജി(ഇദ്ദേഹം ഒന്നാം ഖലീഫ അബൂബക്ർ സ്വിദ്ദീഖി(റ)ന്റെ പതിമൂന്നാം പേരമക നാണ്)യുടെ നേതൃത്വത്തിൽ ഒരു സംഘം കേരളത്തിലെത്തി. അബ്ബാസീ ഖലീഫമാരായ മുഅ്തസിമിന്റെയും വാസിഖിന്റെയും മുഅ്തസിലീ ആശയപ്രചരണവും സമ്മർദ്ദ വുമായിരുന്നു പലായനത്തിന് പ്രേരകം. കായൽപട്ടണത്തിന് ഖാഹിറുൽ ഫതൻ എന്ന് അവർ നാമകരണം ചെയ്തു. കൈറോയുമായുള്ള ബന്ധമാണ് നാമം പ്രതിഫലിപ്പിക്കുന്നത്.രണ്ടാമതായി ഹി.683/ ക്രി.1284 ൽ സയ്യിദ് ജമാലുദ്ദീനിന്റെ നേതൃത്വത്തിൽ ഒരു സംഘം വന്നു. ഈജിപ്തിലെ പ്രകൃതി ദുരന്തങ്ങളാണ് ഈ പലായനത്തിന് കാരണമെ ന്നാണ് കരുതപ്പെടുന്നത്.ഈ അഭിപ്രായമനുസരിച്ച് മുഖദ്ദം പർവ്വതത്തിലേക്ക് ചേർത്താണ് മഖ്ദൂം എന്ന് വിളിക്കപ്പെടുന്നത് എന്ന് അനുമാനിക്കാം.മഖ്ദൂമുമാർ വന്നത് യമനിൽ നിന്നാണെന്ന അര പ്രായവും നിലനിൽക്കുന്നതിനാൽ ഈജിപ്തിൽ നിന്ന് തിരിച്ച സംഘം യമൻ വഴിയാണ് കായൽ പട്ടണത്തെത്തിയ തെന്ന് നിരീക്ഷിക്കാവുന്നതാണ്.മഖ്ദൂമുമാർ പലയിടത്തും മഅ്ബരി എന്ന ദേശ നാമത്തിൽ പരാമർശിക്കപ്പെടാറുണ്ട്. ഇന്ത്യൻ മഹാ സമുദ ത്തിന്റെ തീരത്ത് തമിഴ്നാട്ടിലെ കായൽ പട്ടണത്തിന് തെക് ശം ശ്രീലങ്കക്കഭിമുഖമായി കിടക്കുന്ന പ്രദേശമായ മ്ബറി (ഇപ്പോൾ കോറോമണ്ഡൽ എന്ന പേരിലാണ് ഈ ദേശം അറിയപ്പെടുന്നതി ലേക്ക് ചേർത്താണ് ഇങ്ങനെ വിളിക്കപ്പെടുന്നത്.കേരളത്തിൽ ആദ്യമായി എത്തിയവരിൽ പ്രധാനികളാണ് അഹ്മദ് അൽ മഅ്ബരി, മക്കളായ അലിയ്ക്കൽ മഅ്ബരി, സൈനുദ്ദീൻ ഇബ്റാഹിം മഅ്ബരി തുടങ്ങിയവർ. ശൈഖ് അഹ്മദ് അൽ മഅ്ബരിയുടെ ഒരു മകനായ സൈനുദ്ദീൻ ബിൻ അഹ്മദ് അൽ മഅ്ബരി കൊച്ചിയിലെ ഖാദിയായി നിയമിതനാവുകയും അവിടെ ഇസ്ലാമിക പ്രബോ ധന പ്രവർത്തനങ്ങളിൽ വ്യാപൃതനാവുകയും ചെയ്തു. ഈ സമയത്ത് പൊന്നാനിയിൽ നിന്ന് അൽപം മുസ്ലിം നേതാ ക്കൾ കൊച്ചിയിലെത്തി തങ്ങളുടെ ഖാദിയും മാർഗദർശിയുമാക്കാൻ സൈനുദ്ദീൻ ഇബ്റാഹീമിനെ ക്ഷണിച്ചു. നിർബന്ധത്തിന് വഴങ്ങി അദ്ദേഹംപൊന്നാനിയിലെത്തിച്ചേർന്നു. തുടർന്ന് വർഷങ്ങളോളം മലബാർ മുസ്ലിംകളുടെ കേന്ദ്ര മായി പൊന്നാനിയും മാർഗദർശികളായി മഖ്ദൂമുമാരും മാറി.',
    ),
    BlogPost(
      title: 'ഫദ്ഫരി കുടുംബം',
      content:
          'കേരളത്തിലെ പ്രമുഖ മുസ്ലിം കുടുംബങ്ങളെ പോലെ യമ നിലെ അറബ് ഗോത്രങ്ങളാണ് ഫദ്ഫരികളുടെയും ഉറവി ടം. ഇസ്ലാമിക പ്രബോധനാർത്ഥം കേരളത്തിലേക്കു വന്ന മാലിക് ബിൻ ദീനാറിന്റെ സഹയാത്രികരായിരുന്നു ഇവരുടെ പൂർവികർ. ചാലിയത്തെ പ്രഥമ മസ്ജിദിനരികിൽ താമ സിച്ചിരുന്ന ഇവരുടെ പിൻ തലമുറക്കാരിൽ പെട്ട യമക്ക വീട്ടിൽ തറവാട്ടുകാർ തിരൂരങ്ങാടിയിലേക്കു മാറി താമസിച്ചു. ഏകദേശം നാലു നൂറ്റാണ്ട് മുമ്പ് മുഹ്യിദ്ദീൻ അൽ മക്കിയാണ് ആദ്യമായി പള്ളിപ്പുറത്ത് താമസമാക്കിയത്. എണ്ണക്കച്ചവടക്കാരനായിരുന്ന അദ്ദേഹത്തിന്റെ സ്വഭാവ ത്തിലും സത്യസന്ധതയിലും ആകൃഷ്ടനായി മനക്കൽ നമ്പൂ തിരി കാരണവരാണ് സൗജന്യമായി സ്ഥലവും മറ്റും നൽകി പള്ളിപ്പുറത്തേക്ക് അദ്ദേഹത്തെ കുടുംബ സമേതം ക്ഷണി ച്ചുവരുത്തിയത്. അതിന് ശേഷം പള്ളിപ്പുറം എന്നതിന്റെ അറബീകരണമായ ഫദ്ഫർ എന്നതിലേക്ക് ചേർത്ത് ഇവർ ഫദ്ഫരികൾ എന്നറിയപ്പെട്ടു.ഇന്ന് പടിഞ്ഞാറ്റുമുറി ഈസ്റ്റ് എന്ന പേരിലറിയപ്പെടുന്ന ഈ പ്രദേശത്തെ കുന്നുമ്മൽ എന്ന പറമ്പിലായിരുന്നു ഇവർ ആദ്യം താമസമാക്കിയത്. പിന്നീട് കടലുണ്ടിപ്പുഴയോരത്ത് മഠത്തൊടിയിലേക്കും അവിടെ നിന്ന് കാപ്പാട്ടിലേക്കും ചിലർ മാറി താമസിച്ചു. അതിനാൽ ഇന്നത്തെ തലമുറ ഈ മൂന്ന് തറവാട്ട് പേരിലും അറിയപ്പെടുന്നു. ഇവയെല്ലാം ഒരേ മഹ ല്ല് പരിധിയിൽ വരുന്ന വിവിധ ഭാഗങ്ങളാണെന്നത് പ്രത്യേകം പ്രസ്താവ്യമാണ്.പ്രസിദ്ധ പണ്ഡിതൻ യൂസുഫുൽ ഫദ്ഫരിയുടെ പിതാവായിരുന്ന സൂഫി ഹാജി മുതലുള്ളവരുടെ വിവരങ്ങളാണ് ഇന്ന് ലഭ്യമായിട്ടുള്ളത്. സ്വൂഫി ബിൻ സ്വഫിയ്യ് ബിൻ മുഹ്യിദ്ദീൻ ബിൻ ഉണ്ണേഫ് (ഉണ്ണി സ്വൂഫി) ബിൻ മുഹ്യിദ്ദീൻ ബിൻ ഫിസ്റ്റ് ബിൻ മുഹ്യിദ്ദീൻ അൽയാമക്കി എന്ന താണ് അദ്ദേഹത്തിന്റെ പിതൃ പരമ്പര. അന്വർത്ഥമാക്കിയിരുന്ന അദ്ദേഹം തന്റെ കൃഷിയിടത്തിൽ  കന്നുപൂട്ടുമ്പോൾ പോലും ദിക്റുകളിൽ മുഴുകിയിരുന്നു. സൂഫി ഹാജിയുടെ മൂന്ന് മക്കളിൽ മുഹ്യിദ്ദീൻ, യൂസുഫ് എന്നിവരിലൂടെയാണ് പണ്ഡിത പരമ്പര നിലനിന്നത്.',
    ),
    BlogPost(
      title: 'ചെറുശ്ശേരി കുടുംബം',
      content:
          'കൊണ്ടോട്ടിയിലെ പ്രസിദ്ധ പണ്ഡിത തറവാടായ ചെറു രി കുടുംബത്തിന്റെ വേരുകൾ വ്യക്തമല്ലെങ്കിലും അവ രുടെ പ്രവർത്തന മേഖല പ്രധാനമായും മലപ്പുറം ജില്ലയുടെ വടക്ക് കിഴക്കൻ പ്രദേശങ്ങളായിരുന്നു. ആദ്യകാലങ്ങളിൽ കൊണ്ടോട്ടി തുറക്കൽ എന്ന സ്ഥലത്ത് താമസമാക്കിയിരുന്ന ഈ കുടുംബം നിലവിൽ കൊണ്ടോട്ടി ഖാദിയാരകത്താണ് താമസിക്കുന്നത്. കൊണ്ടോട്ടിയിലെയും ഖാദിയാരകം മഹ ല്ലിലെയും മത, സാമൂഹിക, വിദ്യാഭ്യാസ മേഖലയിൽ അതു ല്യമായ സംഭാവനകൾ നൽകിയവരാണ് ചെറുശ്ശേരി കുടുംബം.ചെറുശ്ശേരി അഹ്മദ്കുട്ടി മുസ്ലിയാരുടെ പിതാമഹൻ അലി ചെറുശ്ശേരി മുതലുള്ള ചരിത്രം മാത്രമാണ് ലഭ്യമായ ത്. അദ്ദേഹത്തിന്റെ പുത്രനാണ് കുഞ്ഞറമു മുസ്ലിയാർ (വ. ഹി.1319/ ക്രി.1901). അർമിയാഅ് എന്നാണ് അദ്ദേഹത്തിന്റെ യഥാർഥ പേര്. കുഞ്ഞറമു മുസ്ലിയാർക്ക് കൊണ്ടോട്ടി മുസ്ലിയാരകത്ത് ഖാദി അലിഹസൻ മുസ്ലിയാരുടെ പുതി ഫാത്വിമ (വ. ഹി: 1316/ ക്രി.1898)യിൽ ജനിച്ച മകനാണ് ചെറുശ്ശേരി അഹ്മദ്കുട്ടി മുസ്ലിയാർ. അദ്ദേഹത്തിന്റെ സഹോദ രൻമാരാണ് ചെറുശ്ശേരി സൈനുദ്ദീൻ മുസ്ലിയാർ, ചെറുശ്ശേരി അലി മുസ്ലിയാർ എന്നിവർ.ചെറുശ്ശേരി സൈനുദ്ദീൻ മുസ്ലിയാർക്ക് മൂന്ന് ആൺ മക്കളുണ്ടായിരുന്നു. മുഹമ്മദ് മുസ്ലിയാർ, അബു മുസ്ലി യാർ, കുഞ്ഞറമുട്ടി മുസ്ലിയാർ. ഇവരിൽ അബു മുസ്ലി യാർ വാഴക്കാട് വെച്ച് ഖുതുബിയുടെ ദർസിൽ പഠിക്കുകയും ശേഷം കുഴിമണ്ണ ഖാദിയായി സേവനം ചെയ്യുകയും ചെയ്തിട്ടുണ്ട്.കുഞ്ഞറമുട്ടി മുസ്ലിയാർ സ്കൂൾ അധ്യാപകനായിരു ന്നു. മുണ്ടപ്പലത്ത് ഖത്വീബായും അദ്ദേഹം ജോലി ചെയ്ത ട്ടുണ്ട്. സഹോദരൻ മുഹമ്മദ് മുസ്ലിയാരാണ് അന്നവിടെ ഖാദി, മുണ്ടപ്പലത്ത് സ്വന്തമായി സ്കൂൾ നടത്തിയിരുന്ന അദ്ദേഹം അതിലെ വരുമാനം പാവങ്ങളെ സഹായിക്കാൻ ഖാദിയാരകത്ത് സംഘടിപ്പിക്കപ്പെട്ട ജമാഅത്തു ഖുല്ലത്തിൽ ഇസ്ലാമിന് നൽകലായിരുന്നു പതിവ്. ഖാദിയാരക മദ്രസ നിർമിക്കുന്നതിന് പിന്നിൽ സജീവമായി പ്രവർത്തിച്ച വരിൽ പ്രമുഖനാണ് കുഞ്ഞറമുട്ടി മുസ്ലിയാർ. അദ്ദേഹ ത്തിന്റെ ചിന്തയാണ് പിൽക്കാലത്ത് ഖാദിയാരകം മഹല്ലിന്റെ വിദ്യാഭ്യാസ രീതിയെ നിയന്ത്രിച്ചത്.കൊണ്ടോട്ടി, വാഴക്കാട്, തവനൂർ, പുളിക്കൽ, മാങ്കാവ് എന്നിവിടങ്ങളിൽ നിന്ന് വിവാഹം ചെയ്ത അഹ്മദ് കുട്ടി മുസ്ലിയാർക്ക് വാഴക്കാട് മുസ്ലിയാരകത്ത് സൈനുദ്ദീൻ മുസ്ലിയാരുടെ മകൾ ഫാത്വിമയിൽ കുഞ്ഞറമു മുസ്ലിയാർ, അലി മുസ്ലിയാർ, സൈനുദ്ദീൻ മുസ്ലിയാർ എന്നിവരും പുളിക്കൽ കൊല്ലോളി മായിന്റെ മകൾ ആമിനക്കുട്ടിയിൽ മുഹമ്മദ് മാസ്റ്ററടക്കമുള്ള ആൺമക്കളും ജനിച്ചിട്ടുണ്ട്. ചെറു ശ്ശേരി മുഹമ്മദ് മുസ്ലിയാരുടെ മകനാണ് സൈനുൽ ഉലമ ചെറുശ്ശേരി സൈനുദ്ദീൻ മുസ്ലിയാർ.ചെറുശ്ശേരി കുടുംബത്തിലെ പ്രഗത്ഭരായ കർമശാസ്ത്ര പണ്ഡിതരായിരുന്നു അവരുടെ കാലത്ത് കേരളത്തിലെ പ്രധാന മുഫ്തിമാർ. അഹ്മദ് കുട്ടി മുസ്ലിയാരൊഴികെയു ള്ളവർ രചനാരംഗത്ത് മുദ്ര പതിപ്പിച്ചിട്ടില്ലെങ്കിലും കേരള ത്തിലെ കർമശാസ്ത്ര മണ്ഡലങ്ങളിൽ അവരുടെ ഇടപെട ലുകൾ ശ്രദ്ധേയമാണ്.',
    ),
    BlogPost(
      title: 'ഖാസിയാരകം കുടുംബം',
      content:
          'ഖാദിയാരകം കുടുംബത്തിന്റെ വേരുകൾ ചെന്നെത്തുന്നത് അന്ത്രോത്ത് ദ്വീപിൽ അന്ത്യവിശ്രമം കൊള്ളുന്ന ഉബൈദുല്ലാഹിൽ മക്കിയിലേക്കാണ്.ഇസ്ലാമിന്റെ ദീപശിഖയുമായി ലക്ഷദ്വീപിലെത്തിയ ആദ്യ വ്യക്തി അബൂബകർ സിദ്ദീഖ്(റ)വിന്റെ പൗത്രനായ ഉബൈദുല്ലാഹിൽ മക്കി എന്ന മഹാനാണ്. അദ്ദേഹം മുഖ നയാണ് ദ്വീപുകാർ മുഴുവനും ഇസ്ലാം സ്വീകരിച്ചത്. ഇന്നും അന്ത്രോത്തിലെ ഖാദി സ്ഥാനം വഹിക്കുന്ന അദ്ദേഹത്തിന്റെ കുടുംബം “ഖാദിന്റവിടെ എന്ന പേരിലറിയപ്പെടുന്നു. ഏകദേശം ആറ് നൂറ്റാണ്ടുകൾക്ക് മുമ്പ് പ്രസ്തുത കുടും ബത്തിലെ ഒരാൾ കേരളക്കരയിലേക്കെത്തി. അദ്ദേഹത്തിന്റെ കുടുംബമാണ് കേരളത്തിൽ "ഖാദിയാരകം" എന്ന പേരിലറിയപ്പെടുന്നത്. ഈ കുടുംബത്തിലെ ഉന്നത നവോത്ഥാന നായകരായിരുന്നു ഖാദി മുഹ്യിദ്ദീനും ഖാദി മുഹമ്മദും. മഖ്ദൂമുകൾക്ക് മുമ്പ് കേരളക്കരയിൽ ദീനീ പ്രബോധന പ്രവർത്തനങ്ങൾക്ക് നേതൃത്വം നൽകിയത് ഈ കുടുംബമാ യിരുന്നു. എന്നാൽ ചരിത്രത്തിലൊരിടത്തും ഈ കുടുംബത്തിന്റെ സാന്നിധ്യം രേഖപ്പെടുത്തപ്പെട്ടിട്ടില്ല.',
    ),
    BlogPost(
      title: 'ഓടക്കൽ കുടുംബം',
      content:
          ' കേരളത്തിലെ ഇസ്ലാമിക കർമശാസ്ത്രമേഖലയുടെ വളർച്ചക്കും വികാസത്തിനും ശ്രദ്ധേയമായ സംഭാവനകളർപ്പിച്ച പണ്ഡിത തറവാടുകളിൽ പ്രസിദ്ധമാണ് ഓടക്കൽ. ഒറ്റകത്ത് തറവാട് എന്ന പേരിലും ഇവർ അറിയപ്പെടാറുണ്ട്. യമനീ പാരമ്പര്യവും മഖ്ദൂമുമാരുമായുള്ള കുടുംബ ബന്ധവും ഈ തറവാടിന്റെ ആത്മീയവും ബൗദ്ധികവുമായ മുന്നേറ്റത്തിന് മാറ്റുകൂട്ടുന്നു. കനപ്പെട്ട രചനകളോ ക്രോഡീ കൃത ഫത്വകളോ അന്യം നിൽക്കെ പ്രസിദ്ധമായ കർമ ശാസ്ത്ര തറവാടുകളിൽ ഇടം പിടിക്കാൻ ഓടക്കലിനെ സഹായിച്ചത് ഉപര്യുക്ത പാരമ്പര്യമായിരുന്നു. യമനിൽ നിന്ന് വന്ന് പൊന്നാനിയിലൂടെ വളർന്ന് മലപ്പുറം ജില്ലയുടെ വിവിധ ഭാഗങ്ങളിലായി പടർന്നു പന്തലിച്ച് തറവാട് സൂക്ഷ്മാലു ക്കളും ഭയഭക്തരുമായ ധാരാളം ഖാദിമാർക്കും മുദരിസു മാർക്കും ജന്മം നല്കി. കേരളത്തിൽ നിലവിലുള്ള മിക്ക തല മുതിർന്ന പണ്ഡിതപ്രമുഖരും ഓടക്കൽ പണ്ഡിതരുടെ ശിഷ്യ ഗണങ്ങളാണെന്നത് അവർ ബാക്കിവെച്ച അനർഘ ശേഷി പ്പുകളുടെ ഗുണവും നിലവാരവും അടയാളപ്പെടുത്തുന്നുണ്ട്.മലപ്പുറം ജില്ലയിൽ പൊന്നാനി, തിരൂരങ്ങാടി, മറ്റത്തൂർ അങ്ങാടി, മറ്റത്തൂർ മുനമ്പത്ത്, തിരൂർ, വേങ്ങര, ഊരകം, കുഴിപ്പുറം, ഒതുക്കുങ്ങൽ തുടങ്ങിയ പ്രദേശങ്ങളിൽ പരന്നു കിടക്കുന്ന തറവാടിന്റെ പുതുതലമുറ അധ്യാപകരും ഗവേ ഷകരും സംഘടനകളിൽ പലതിന്റെയും നേതാക്കളുമായി സാന്നിധ്യമറിയിച്ചു കൊണ്ടിരിക്കുന്നു.ഹിജ്റാബ്ദം പതിനൊന്നാം നൂറ്റാണ്ടിന്റെ തുടക്കത്തിൽ യമനിൽ നിന്ന് പൊന്നാനിയിലെത്തിയ പണ്ഡിതനും സൂഫിവര്യനുമായ ശൈഖ് അബ്ദുർറഹിമാൻ അൽ അദനിയിൽ നിന്നാണ് ഓടക്കൽ തറവാടിന്റെ തുടക്കം. മതപ്രബോധനവും വിജ്ഞാന പ്രചരണവും ലക്ഷ്യമാക്കിയ ശൈഖ് അദനി പൊന്നാനിയിലെ മഖ്ദൂം കുടുംബവുമായും പണ്ഡിത കാരണവരുമായും അടുത്ത ബന്ധം പുലർത്താൻ താൽപ ര്യപ്പെട്ടു. പുത്രി ഫാത്വിമയെ ജീവിത പങ്കാളിയാക്കി നിശ്ച യിച്ചുകൊടുത്തുകൊണ്ടാണ് മഖ്ദൂം രണ്ടാമൻ ശൈഖ് അദ നിയോട് ആദരവ് പ്രകടിപ്പിച്ചത്. സന്തോഷകരമായ ദാമ്പ ത്യജീവിതം വർഷങ്ങൾ പിന്നിട്ടപ്പോൾ മതപ്രബോധന ത്തിന്റെ വഴിയിൽ കൂടുതൽ സംഭാവനകൾ സമർപ്പിക്കാനായി നാടുവിട്ടുപോകാൻ തീർച്ചപ്പെടുത്തിയ അദ്ദേഹത്തിന്റെ പിൽകാല ജീവിതം രേഖപ്പെടുത്തപ്പെട്ടതായി കാണുന്നില്ല. യാത്ര പുറപ്പെടുന്നതിന് മുമ്പ് ഭാര്യക്കു നൽകിയ അന്ത്യോ പദേശങ്ങളിൽ വസ്വിയ്യത്ത്) പ്രധാനപ്പെട്ടത് ഗർഭത്തിലിരിക്കുന്ന കുഞ്ഞ് ആണാണെങ്കിൽ അലി ഹസൻ എന്നും പെണ്ണാണെങ്കിൽ ഫാത്വിമയെന്നും പേരുവെക്കണമെന്നതായിരുന്നു.',
    ),
    
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        iconTheme: IconThemeData(color: Colors.white),
        backgroundColor: Color.fromARGB(255, 97, 135, 110),
        title: const Text(
          'പണ്ഡിത കുടുംബങ്ങൾ',
          style: TextStyle(
            fontSize: 16.0,
            fontWeight: FontWeight.bold,
            color: Colors.white,
          ),
        ),
      ),
      body: ListView.builder(
        itemCount: allPosts.length,
        itemBuilder: (context, index) {
          return BlogPostCard(allPosts[index]);
        },
      ),
    );
  }
}

class BlogPostCard extends StatelessWidget {
  final BlogPost post;

  BlogPostCard(this.post);

  @override
  Widget build(BuildContext context) {
    return Card(
  margin: const EdgeInsets.all(10.0),
  elevation: 2.0,
  shape: RoundedRectangleBorder(
    borderRadius: BorderRadius.circular(12.0),
  ),
  child: GestureDetector(
    // onTap: () {
    //   Navigator.push(
    //     context,
    //     MaterialPageRoute(
    //       builder: (context) => BlogPostDetailsScreen(post),
    //     ),
    //   );
    // },
    child: Container(
      decoration: BoxDecoration(
        borderRadius: BorderRadius.circular(12.0),
        color: Colors.grey[100], // Light pastel color
      ),
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              post.title,
              style: const TextStyle(
                fontSize: 18.0,
                fontWeight: FontWeight.bold,
                color: Colors.black87,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              textAlign: TextAlign.justify,
              post.content,
              style: TextStyle(
                fontSize: 12.0,
                color: Colors.grey[800],
              ),
            ),
          ],
        ),
      ),
    ),
  ),
);
  }
}

class BlogPostDetailsScreen extends StatelessWidget {
  final BlogPost post;

  BlogPostDetailsScreen(this.post);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color.fromARGB(255, 172, 103, 3),
        title: Text(post.title,
          style: const TextStyle(
            fontSize: 14.0,
            fontWeight: FontWeight.bold,
            color: Colors.white,
          ),
          ),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Center(
                child: Center(
                  child: Text(
                    post.title,
                    style: const TextStyle(
                  fontSize: 18.0,
                  fontWeight: FontWeight.bold,
                  color: Colors.grey,
                          ),
                    textAlign: TextAlign.left,
                  ),
                ),
              ),
              SizedBox(height: 20,),
              Text(
                post.content,
                style: const TextStyle(
                  fontSize: 11.0,
                  fontFamily: 'Manjari',
                ),
                textAlign: TextAlign.justify,
              ),
            ],
          ),
        ),
      ),
    );
  }
}

class BlogPost {
  final String title;
  final String content;

  BlogPost({
    required this.title,
    required this.content,
  });
}
































