import 'package:flutter/material.dart';

void main() {
  runApp(MyApp());
}

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      home: Thkudumbam(),
    );
  }
}

class Thkudumbam extends StatefulWidget {
  @override
  _ThkudumbamState createState() => _ThkudumbamState();
}

class _ThkudumbamState extends State<Thkudumbam> {
  List<BlogPost> allPosts = [
    BlogPost(
      title: 'ബുഖാരി',
      content:
          'ബാ അലവി സാദാത്തുക്കളിൽ പെടാത്ത ചില സയ്യിദ് കുടും ബങ്ങളും കേരളത്തിലുണ്ട്. കേരളത്തിൽ വ്യാപക സാന്നിധ്യമുള്ള ബുഖാരി ഖബീല അതിലൊന്നാണ്. സയ്യിദ് അലിയ്യുൽ ഉറൈളിയുടെ സഹോദരൻ സയ്യിദ് മൂസൽ ഖാളിമിന്റെ സന്താനപരമ്പരയിലാ ണ് ബുഖാരി സാദാത്ത്. ഉസ്ബെക്കിസ്താനിലെ ബുഖാറയിൽ താമസമാക്കിയതിനാലാണ് ഇവരെ ബുഖാരി തങ്ങൻമാർ എന്ന് വിളിക്കുന്നത്. സയ്യിദ് അഹ്മദ് ജലാലുദ്ദീൻ എന്നവരാണ് കേരളത്തി ആദ്യമെത്തിയ ബുഖാരി തങ്ങൾ.',
    ),
    BlogPost(
      title: 'ശിഹാബ്',
      content:
          'ഹി. 895 ൽ വഫാത്തായ സയ്യിദ് അലിയുടെ പുത്രൻ സയ്യിദ് അബ്ദുർറഹ്മാന്റെ പുത്രനാണ് സയ്യിദ് അഹ്മദ് ശിഹാബുദ്ദീൻ. ബാ അലവികളിൽ പെട്ട ശിഹാബ് ഖബീല ഇദ്ദേഹത്തിലേക്ക് വംശാവലി ചേർക്കപ്പെട്ടതു കൊണ്ടാണ് കുടുംബ നാമം അപ്രകാരമായത്. പാണക്കാട് സയ്യിദ് കുടുംബം ഈ വംശാവലിയുടെ തുടർച്ചയാണ്.',
    ),
    BlogPost(
      title: 'ജമലുല്ലൈലി',
      content:
          'ഫഖീഹ് മുഖദ്ദമിന്റെ സന്താനത്തുടർച്ചയിൽ അഞ്ചാം തലമുറക്കാരനാണ് സയ്യിദ് മുഹമ്മദ് ജമലുല്ലൈലി. അവരുടെ വംശാവലി ജമലുല്ലൈൽ ഖബീല എന്ന പേരിൽ അറിയപ്പെടുന്നു. ഹി. 750ൽ തരീമിലാണ് അദ്ദേഹത്തിന്റെ ജനനം. രാത്രി കാലങ്ങളിൽ ഇബാദ ത്തിൽ പുലർത്തിയ നിഷ്ഠയും ശുഷ്കാന്തിയുമാണ് ജമലുല്ലൈൽ എന്ന നാമകരണ നിമിത്തം. ഹി. 845 ദുൽഹിജ്ജ 17 ന് തരീമിൽ അദ്ദേഹം വഫാത്തായി. സൻബുൽ മഖ്ബറയിലാണ് അദ്ദേഹത്തിന്റെ മഖാം. അലി, അബ്ദുല്ല എന്ന രണ്ട് മക്കളാണ് അദ്ദേഹത്തിനുണ്ടാ യിരുന്നത്. ഇവരുടെ സന്താനപരമ്പര വിവിധ ശാഖകളായാണ് പിൽകാലത്ത് അറിയപ്പെട്ടത്.',
    ),
    BlogPost(
      title: 'ഹൈദറൂസി',
      content:
          'സയ്യിദ് അബ്ദുർറഹ്മാനുസ്സഖാഫിന്റെ പൗത്രനും സയ്യിദ് അബൂബക്ർ സകറാന്റെ മകനുമാണ് അബ്ദുല്ല അൽ ഐദറൂസി. ബാ അലവി സയ്യിദ് വംശാവലിയിലെ ഐ ദറൂസി ഖബീല ഇദ്ദേഹ ത്തിലേക്കാണ് ചേർക്കപ്പെടുന്നത്. ഹി. 811ൽ സയ്യിദ് അബ്ദുല്ല തരീമിൽ ജനിച്ചു. പത്താം വയസ്സിൽ പിതാവ് മരണപ്പെട്ടു. പിതൃവ്യൻ ഉമർ മുഹററിന്റെ ശിക്ഷണത്തിലും സംരക്ഷണത്തിലുമാണ് അദ്ദേഹം വളർന്നത്. ഖുർആൻ, ഫിഖ്ഹ്, തസ്വവുഫ് വിഷയങ്ങളിൽ വിവിധ ഗുരുക്കളിൽ നിന്ന് വ്യുൽപത്തിനേടി. പിതൃവ്യപുത്രി ആഇശയാ ണ് സയ്യിദ് അബ്ദുല്ലയുടെ സഹധർമിണി. ഈ ദാമ്പത്യത്തിൽ പത്ത് മക്കൾ ജനിച്ചു. ഹി. 865 ൽ സയ്യിദ് അബ്ദുല്ല വഫാത്തായി. സൻബുൽ മഖ്ബറയിൽ അന്ത്യവിശ്രമം കൊള്ളുന്നു. സമസ്ത പ്രസിഡന്റും ജാമിഅഃ നൂരിയ്യഃ പ്രിൻസിപ്പലുമായിരുന്ന അസ്ഹരി തങ്ങൾ ഐദറൂസി ഖബീലാംഗമാണ്.',
    ),

    BlogPost(
      title: 'സഖാഫ്',
      content:
          'കേരളത്തിലെ യമനി പാരമ്പര്യത്തിന്റെ ഭാഗമായ സയ്യിദ് കുടുംബമാണ് സഖാഫ്.യമനിനു പുറമെ ഗൾഫ് അറബ് രാജ്യങ്ങളിലും സിറിയയിലും ഏഷ്യയുടെ തെക്ക് കിഴക്കൻ രാജ്യങ്ങളിലും സഖാഫ് ഖബീല വ്യാപിച്ച് കിടക്കുന്നു. സയ്യിദ് മൗലദ്ദവീലയുടെ സന്താനങ്ങളിൽപെട്ട അബ്ദുർറഹ്മാനുസ്സഖാഫിന്റെ വംശാവലിയാണ് സഖാഫ്. സഖാഫ് എന്നത് സയ്യിദ് അബ്ദുർറഹ്മാൻ എന്നവരുടെ വിശേഷനാമമാണ്. സമകാലിക സൂഫികളിലും പണ്ഡിതരിലും അദ്ദേഹത്തിന്റെ പദവിയെയാണ് പ്രസ്തുത വിശേഷനാമം അടയാളപ്പെടുത്തുന്നത്. വീടിന്റെ മേൽക്കൂര പോലെ ഔന്നത്യത്തിൽ അബ്ദുർറഹ്മാനുസ്സഖാഫ് ഉയർന്നു നിന്നു. ഹി. 739ൽ അബ്ദുർറഹ്മാനുസ്സഖാഫ് യമനിലെ തരീമിൽ ജനിച്ചു. ഹി.819 ലാണ് അദ്ദേഹത്തിന്റെ വഫാത്ത്. സൻബുലിലെ മഖ്ബറയിൽ അന്ത്യവിശ്രമംകൊള്ളുന്നു. പതിമൂന്ന് ആൺ മക്കളും ഏഴ് പെൺ മക്കളുമുണ്ടായിരുന്നു അദ്ദേഹത്തിന്. അദ്ധ്യാത്മിക ചിന്താലഹരിയിൽ ഉന്മാദാവസ്ഥ പ്രാപിച്ച സയ്യിദ് അബൂബക്ർ സക്റാൻ സയ്യിദ് അബ്ദുർറഹ്മാന്റെ ഇളയ പുത്രനാണ്.',
    ),
    
    
    BlogPost(
      title: 'ബാഫഖി',
      content:
          'സയ്യിദ് അബ്ദുർറഹ്മാൻ ബാഫഖീ തങ്ങളുടെ വംശപരമ്പരയായ ബാഫഖി ഖബീലയും യമനിൽ നിന്നാണ് മലബാറിലെത്തിയത്. ഹി. 1007 ൽ തരീമിൽ ദിവംഗതനായ സയ്യിദ് ഹാഫിള് മുഹമ്മദിന്റെ പുത്രൻ സയ്യിദ് അലി ബാഫഖിയുടെ പിൻമുറക്കാരാണ് കൊയിലാണ്ടിയിൽ താമസമാക്കിയ ബാഫഖി കുടുംബം, ഫഖീഹ് മുഖദമിന്റെ പൗത്രൻ സയ്യിദ് മുഹമ്മദ് മുതലാണ് ബാഫഖി കുടുംബം ആരംഭിക്കുന്നത്',
    ),
    BlogPost(
      title: 'ജിഫ്രി',
      content:
          'ഫഖീഹ് മുഖദ്ദമിന്റെ നാലാം തലമുറയിൽപെട്ട പ്രധാനിയാണ് സയ്യിദ് മുഹമ്മദ്. അദ്ദേഹത്തിന് പതിനൊന്ന് സന്താനങ്ങളുണ്ടായിരു ന്നു. സയ്യിദ് മുഹമ്മദിന്റെ ഇളയ മകനാണ് സയ്യിദ് അബൂബക്ർ ജുഫ്ർ. അവരിലേക്ക് ചേർക്കപ്പെട്ടതാണ് ജീ കുടുംബം. സയ്യിദ് അബൂബക്ർ ജുഫ്റിന്റെ മകൻ അലിയ്യുൽ ഖവ്വാസിലേക്കാണ് കേരളത്തിലെ ജുഫ്രീ ഖബീല എത്തിച്ചേരുന്നത്. സയ്യിദ് അലിയ്യുൽ ഖവ്വാസിന്റെ മകൻ സയ്യിദ് അബ്ദുർറഹ്മാന്റെ പിൻമുറക്കാരാണ് മലബാറിലെത്തിയ ജഫ്രീ കുടുംബം. ഹി. 1222ൽ വഫാത്തായ ശൈഖ് മുഹമ്മദ് ജുഫ്തി ഈ കുടുംബത്തിലെ പ്രധാനികളിൽ ഒരാളാണ്.',
    ),
    
    BlogPost(
      title: 'അൽ ഹാദി',
      content:
          'മലബാറിലെ മറ്റൊരു സയ്യിദ് കുടുംബമാണ് അൽ ഹാദി ശിഹാബു ദ്ദീൻ ഖബീലയിലെ ആദ്യ കണ്ണിയായ സയ്യിദ് അഹ്മദ് ശിഹാബുദ്ദീന് മൂന്ന് മക്കളാണുണ്ടായിരുന്നത്. അതിൽപെട്ട സയ്യിദ് മുഹമ്മദുൽ ഹാദി ഹി. 971ൽ ഇന്ത്യയിലാണ് വഫാത്തായത്. അദ്ദേഹത്തിന്റെ സഹോദരൻ അബ്ദുർറഹ്മാനുൽ ഖാളിക്ക് നാ ലുമക്കളായിരുന്നു. അവരിൽ സയ്യിദ് അബ്ദുല്ലയുടെയും സയ്യിദ് മുഹമ്മദുൽ ഹാദിയുടെയും സന്താന ശൃംഖലയാണ് മലബാറിലെ അൽ ഹാദി സയ്യിദ് ഖബീല',
    ),
    BlogPost(
      title: 'ആലു മഷ്ഹൂർ',
      content:
          'സയ്യിദ് അബ്ദുർറഹ്മാനുൽ ഖാളിയുടെ മറ്റൊരു പുത്രനാണ് ശിഹാബുദ്ദീൻ അസ്ഗർ. അദ്ദേഹത്തിന്റെ പുത്രനാണ് സയ്യിദ് മുഹമ്മദ്. അദ്ദേഹത്തിന് അഹ്മദ്, അലി, ഐദറൂസ് എന്നീ പുത്രൻ മാരുണ്ടായിരുന്നു. ഇവരിൽ സയ്യിദ് അഹ്മദിന്റെ ഏകപുത്രനാണ് സയ്യിദ് മുഹമ്മദ് മശ്ഹൂർ. ഹി. 1130 ൽ അദ്ദേഹം വഫാത്തായി. ഇദ്ദേഹത്തിന്റെ മൂന്നാമത്തെ പുത്രൻ സയ്യിദ് അബ്ദുർറഹ്മാന്റെ പിൻമുറക്കാരാണ് കേരളത്തിലെ മശ്ഹൂർ തങ്ങൻമാർ',
    ),
    
    BlogPost(
      title: 'മമ്പുറം തങ്ങൾ കുടുംബം',
      content:
          'സയ്യിദ് മുഹമ്മദ് മൗലദ്ദവീലയുടെ പുത്രനാണ് സയ്യിദ് അലവി.ഹി. 798 ൽ അദ്ദേഹം വഫാത്തായി. അവരുടെ പിൻമുറക്കാരാണ് മമ്പുറം തങ്ങൻമാർ. ആലു മുഖൈബിലും ഈ താവഴിയിലുള്ള സയ്യിദ് കുടുംബമാണ്. സയ്യിദ് അലവിയുടെ പൗത്രനായ സയ്യിദ് അബ്ദുർറഹ്മാൻ മൗലാഖലയിൽ നിന്നാണ് മൗലാഖല ഖബീലയുടെ തുടക്കം. ആലു സഹ്ൽ ഖൈലയും ഈ വംശാ വലിയിൽ പെട്ടവരാണ്. മമ്പുറം സയ്യിദ് അലവി തങ്ങളും മകൻ സയ്യിദ് ഫള്ൽ തങ്ങളും ഇവരിൽ പെട്ടവരാണ്',
    ),
    BlogPost(
      title: 'മുഖൈബിലി',
      content:
          'ഒമാനിലെ ളുഫാറിൽ നിന്ന് കേരളത്തിലെത്തിയ സയ്യിദ് ഖബീല യാണ് മുഖൈബിലി സാദാത്ത്. ഹി. 1285 ൽ വഫാത്തായ സയ്യിദ് ഉമർ ഈ ഖബീലയിലെ അംഗമാണ്.',
    ),
    BlogPost(
      title: 'ഐദിത്',
      content:
          'അമ്മുൽ ഫഖീഹ് എന്ന പേരിൽ പ്രസിദ്ധിയാർജിച്ച സയ്യിദ് അലവിയുടെ ആറാം തലമുറയിൽ പെട്ടവരാണ് സയ്യിദ് മുഹമ്മദ് സ്വാഹിബു ഐദീദ് എന്ന പേരിൽ അറിയപ്പെടുന്ന അദ്ദേഹം ഹി 862 ൽ വഫാത്തായി. അദ്ദേഹത്തിന്റെ നാലു പുത്രൻമാരിൽ ഇളയ മകനാണ് അലി ഐദീദ്. ഹി. 919 ൽ അവർ വഫാത്തായി. അവരു ടെ മൂത്തപുത്രൻ സയ്യിദ് മുഹമ്മദ് മഹ്ജൂബിന്റെ പിൻമുറക്കാരാണ് കേരളത്തിലെ ഐദീദ് സാദാത്തുക്കൾ.',
    ),
    BlogPost(
      title: 'ഹദ്ദാദ്',
      content:
          'അമ്മുൽ ഫഖീഹിന്റെ പുത്രപരമ്പരയിലെ അഞ്ചാം തലമുറക്കാരനാണ് സയ്യിദ് അഹ്മദ് മുസിഫ. സ്വാഹിബുൽ ഹുത്വ എന്ന പേരിൽ അറിയപ്പെടുന്ന സയ്യിദ് അലി അദ്ദേഹത്തിന്റെ സഹോദരനാണ്. സയ്യിദ് അഹ്മദ് മുസിഫയുടെ പുത്രപരമ്പരയിൽ ഒമ്പതാമനാണ് സയ്യിദ് അലവി(റ).ഹി. 1072 ൽ തരീമിൽ അദ്ദേഹം വഫാത്തായി.അവരുടെ മകനാണ് ഹദ്ദാദ് റാത്തീബ് സമാഹരിച്ച അബ്ദുല്ലാഹിൽ ഹദ്ദാദ്. അവരുടെ സഹോദരൻ സയ്യിദ് അലി അൽഹദ്ദാദിന്റെ പിൻമുറക്കാരാണ് സൂറത്തിലും മലബാറിലുമുള്ള ഹദ്ദാദ് സയ്യിദ് വംശജർ.',
    ),
    BlogPost(
      title: 'ഹബ്ശി',
      content:
          'സയ്യിദ് മുഹമ്മദ് അസദുല്ലയുടെ പുത്രനാണ് സയ്യിദ് അഹ്മദ്. സയ്യിദ് അഹ്മദിന്റെ സഹോദരനാണ് സയ്യിദ് മുഹമ്മദ് ജമലുല്ലൈ ലിന്റെ പിതാവ് സയ്യിദ് ഹസനുൽ മുഅല്ലം. സയ്യിദ് അഹ്മദിന്റെ പൗത്രൻ സയ്യിദ് അബൂബക്ർ അൽ ഹബ്ഗിയിലേക്കാണ് ഹബി ഖബീലയുടെ വംശാവലി ചേർക്കപ്പെടുന്നത്. അദ്ദേഹം ഹി. 857 ൽ തരീമിൽ വഫാത്തായി. സയ്യിദ് അബൂബക്ർ അൽ ഹബിയുടെ പൗത്ര പുത്രൻ സയ്യിദ് അബ്ദുർറഹ്മാന്റെ പിൻമുറക്കാരാണ് കേരളത്തിലെ ഹബീ സാദാത്തുക്കൾ',
    ),
    
    BlogPost(
      title: 'അഹ്ദൽ',
      content:
          'കേരളത്തിലെ ബാഅലവി ഇതര സയ്യിദ് കുടുംബമാണ് അഹ്ദലികൾ. സയ്യിദ് മൂസൽ ഖാളിമിന്റെ പത്താം തലമുറയിലെ സയ്യിദ് അലിയ്യുൽ അഹ്ദലിന്റെ പിൻമുറക്കാരാണ് അഹ്ദലി ഖബീല സയ്യിദ് അഹ്ദൽ എന്നവരുടെ മകൻ സയ്യിദ് യഹ്യ മകൻ സയ്യിദ് ഹുസൈൻ മകൻ സയ്യിദ് യഹ്യ അഹ്ദലിയാണ് കേരളത്തിൽ ആദ്യമെത്തിയ അഹ്ദലി തങ്ങൾ. കണ്ണൂരിലെ വളപട്ടണത്താണ് താമസമാക്കിയത്.',
    ),
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        iconTheme: IconThemeData(color: Colors.white),
        backgroundColor: Color.fromARGB(255, 97, 135, 110),
        title: const Text(
          'സയ്യിദ് കുടുംബങ്ങൾ',
          style: TextStyle(
            fontSize: 16.0,
            fontWeight: FontWeight.bold,
            color: Colors.white,
          ),
        ),
      ),
      body: ListView.builder(
        itemCount: allPosts.length,
        itemBuilder: (context, index) {
          return BlogPostCard(allPosts[index]);
        },
      ),
    );
  }
}

class BlogPostCard extends StatelessWidget {
  final BlogPost post;

  BlogPostCard(this.post);

  @override
  Widget build(BuildContext context) {
    return Card(
  margin: const EdgeInsets.all(10.0),
  elevation: 2.0,
  shape: RoundedRectangleBorder(
    borderRadius: BorderRadius.circular(12.0),
  ),
  child: GestureDetector(
    // onTap: () {
    //   Navigator.push(
    //     context,
    //     MaterialPageRoute(
    //       builder: (context) => BlogPostDetailsScreen(post),
    //     ),
    //   );
    // },
    child: Container(
      decoration: BoxDecoration(
        borderRadius: BorderRadius.circular(12.0),
        color: Colors.grey[100], // Light pastel color
      ),
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              post.title,
              style: const TextStyle(
                fontSize: 18.0,
                fontWeight: FontWeight.bold,
                color: Colors.black87,
              ),
            ),
            SizedBox(height: 8.0),
            Text(
              textAlign: TextAlign.justify,
              post.content,
              style: TextStyle(
                
                fontSize: 13.0,
                color: Colors.grey[800],
              ),
            ),
          ],
        ),
      ),
    ),
  ),
);

  }
}

// class BlogPostDetailsScreen extends StatelessWidget {
//   final BlogPost post;

//   BlogPostDetailsScreen(this.post);

//   @override
//   Widget build(BuildContext context) {
//     return Scaffold(
//       appBar: AppBar(
//         backgroundColor: const Color.fromARGB(255, 172, 103, 3),
//         title: Text(post.title,
//           style: const TextStyle(
//             fontSize: 14.0,
//             fontWeight: FontWeight.bold,
//             color: Colors.white,
//           ),
//           ),
//       ),
//       body: Padding(
//         padding: const EdgeInsets.all(16.0),
//         child: Column(
//           crossAxisAlignment: CrossAxisAlignment.start,
//           children: [
//             Center(
//               child: Text(
//                 post.title,
//                 style: const TextStyle(
//               fontSize: 18.0,
//               fontWeight: FontWeight.bold,
//               color: Colors.grey,
//                       ),
//                 textAlign: TextAlign.justify,
//               ),
//             ),
//             SizedBox(height: 20,),
//             Text(
//               post.content,
//               style: const TextStyle(
//                 fontSize: 11.0,
//                 fontFamily: 'Manjari',
//               ),
//               textAlign: TextAlign.justify,
//             ),
//           ],
//         ),
//       ),
//     );
//   }
// }

class BlogPost {
  final String title;
  final String content;

  BlogPost({
    required this.title,
    required this.content,
  });
}
